flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*! @brief Read current value of the MCG_ATCVL_ATCVL field. */
#define BR_MCG_ATCVL_ATCVL(x) (HW_MCG_ATCVL(x).U)

/*! @brief Format value for bitfield MCG_ATCVL_ATCVL. */
#define BF_MCG_ATCVL_ATCVL(v) ((uint8_t)((uint8_t)(v) << BP_MCG_ATCVL_ATCVL) & BM_MCG_ATCVL_ATCVL)

/*! @brief Set the ATCVL field to a new value. */
#define BW_MCG_ATCVL_ATCVL(x, v) (HW_MCG_ATCVL_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_MCG_C7 - MCG Control 7 Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_C7 - MCG Control 7 Register (ROZ)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_c7
{
    uint8_t U;
    struct _hw_mcg_c7_bitfields
    {
        uint8_t RESERVED0 : 8;         /*!< [7:0]  */
    } B;
} hw_mcg_c7_t;

/*!
 * @name Constants and macros for entire MCG_C7 register
 */
/*@{*/
#define HW_MCG_C7_ADDR(x)        ((uint32_t)(x) + 0xCU)

#define HW_MCG_C7(x)             (*(__I hw_mcg_c7_t *) HW_MCG_C7_ADDR(x))
#define HW_MCG_C7_RD(x)          (HW_MCG_C7(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_C7 bitfields
 */

/*******************************************************************************
 * HW_MCG_C8 - MCG Control 8 Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_C8 - MCG Control 8 Register (RW)
 *
 * Reset value: 0x80U
 */
typedef union _hw_mcg_c8
{
    uint8_t U;
    struct _hw_mcg_c8_bitfields
    {
        uint8_t RESERVED0 : 6;         /*!< [5:0]  */
        uint8_t LOLRE : 1;             /*!< [6] PLL Loss of Lock Reset Enable */
        uint8_t RESERVED1 : 1;         /*!< [7]  */
    } B;
} hw_mcg_c8_t;

/*!
 * @name Constants and macros for entire MCG_C8 register
 */
/*@{*/
#define HW_MCG_C8_ADDR(x)        ((uint32_t)(x) + 0xDU)

#define HW_MCG_C8(x)             (*(__IO hw_mcg_c8_t *) HW_MCG_C8_ADDR(x))
#define HW_MCG_C8_RD(x)          (HW_MCG_C8(x).U)
#define HW_MCG_C8_WR(x, v)       (HW_MCG_C8(x).U = (v))
#define HW_MCG_C8_SET(x, v)      (BME_OR8(HW_MCG_C8_ADDR(x), (uint8_t)(v)))
#define HW_MCG_C8_CLR(x, v)      (BME_AND8(HW_MCG_C8_ADDR(x), (uint8_t)(~(v))))
#define HW_MCG_C8_TOG(x, v)      (BME_XOR8(HW_MCG_C8_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual MCG_C8 bitfields
 */

/*!
 * @name Register MCG_C8, field LOLRE[6] (RW)
 *
 * Determines if a interrupt or a reset request is made following a PLL loss of
 * lock.
 *
 * Values:
 * - 0 - Interrupt request is generated on a PLL loss of lock indication. The
 *     PLL loss of lock interrupt enable bit must also be set to generate the
 *     interrupt request.
 * - 1 - Generate a reset request on a PLL loss of lock indication.
 */
/*@{*/
#define BP_MCG_C8_LOLRE      (6U)          /*!< Bit position for MCG_C8_LOLRE. */
#define BM_MCG_C8_LOLRE      (0x40U)       /*!< Bit mask for MCG_C8_LOLRE. */
#define BS_MCG_C8_LOLRE      (1U)          /*!< Bit field size in bits for MCG_C8_LOLRE. */

/*! @brief Read current value of the MCG_C8_LOLRE field. */
#define BR_MCG_C8_LOLRE(x)   (BME_UBFX8(HW_MCG_C8_ADDR(x), BP_MCG_C8_LOLRE, BS_MCG_C8_LOLRE))

/*! @brief Format value for bitfield MCG_C8_LOLRE. */
#define BF_MCG_C8_LOLRE(v)   ((uint8_t)((uint8_t)(v) << BP_MCG_C8_LOLRE) & BM_MCG_C8_LOLRE)

/*! @brief Set the LOLRE field to a new value. */
#define BW_MCG_C8_LOLRE(x, v) (BME_BFI8(HW_MCG_C8_ADDR(x), ((uint8_t)(v) << BP_MCG_C8_LOLRE), BP_MCG_C8_LOLRE, 1))
/*@}*/

/*******************************************************************************
 * HW_MCG_C9 - MCG Control 9 Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_C9 - MCG Control 9 Register (ROZ)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_c9
{
    uint8_t U;
    struct _hw_mcg_c9_bitfields
    {
        uint8_t RESERVED0 : 8;         /*!< [7:0]  */
    } B;
} hw_mcg_c9_t;

/*!
 * @name Constants and macros for entire MCG_C9 register
 */
/*@{*/
#define HW_MCG_C9_ADDR(x)        ((uint32_t)(x) + 0xEU)

#define HW_MCG_C9(x)             (*(__I hw_mcg_c9_t *) HW_MCG_C9_ADDR(x))
#define HW_MCG_C9_RD(x)          (HW_MCG_C9(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_C9 bitfields
 */

/*******************************************************************************
 * HW_MCG_C10 - MCG Control 10 Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_C10 - MCG Control 10 Register (ROZ)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_c10
{
    uint8_t U;
    struct _hw_mcg_c10_bitfields
    {
        uint8_t RESERVED0 : 8;         /*!< [7:0]  */
    } B;
} hw_mcg_c10_t;

/*!
 * @name Constants and macros for entire MCG_C10 register
 */
/*@{*/
#define HW_MCG_C10_ADDR(x)       ((uint32_t)(x) + 0xFU)

#define HW_MCG_C10(x)            (*(__I hw_mcg_c10_t *) HW_MCG_C10_ADDR(x))
#define HW_MCG_C10_RD(x)         (HW_MCG_C10(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_C10 bitfields
 */

/*******************************************************************************
 * hw_mcg_t - module struct
 ******************************************************************************/
/*!
 * @brief All MCG module registers.
 */
#pragma pack(1)
typedef struct _hw_mcg
{
    __IO hw_mcg_c1_t C1;                   /*!< [0x0] MCG Control 1 Register */
    __IO hw_mcg_c2_t C2;                   /*!< [0x1] MCG Control 2 Register */
    __IO hw_mcg_c3_t C3;                   /*!< [0x2] MCG Control 3 Register */
    __IO hw_mcg_c4_t C4;                   /*!< [0x3] MCG Control 4 Register */
    __IO hw_mcg_c5_t C5;                   /*!< [0x4] MCG Control 5 Register */
    __IO hw_mcg_c6_t C6;                   /*!< [0x5] MCG Control 6 Register */
    __IO hw_mcg_s_t S;                     /*!< [0x6] MCG Status Register */
    uint8_t _reserved0[1];
    __IO hw_mcg_sc_t SC;                   /*!< [0x8] MCG Status and Control Register */
    uint8_t _reserved1[1];
    __IO hw_mcg_atcvh_t ATCVH;             /*!< [0xA] MCG Auto Trim Compare Value High Register */
    __IO hw_mcg_atcvl_t ATCVL;             /*!< [0xB] MCG Auto Trim Compare Value Low Register */
    __I hw_mcg_c7_t C7;                    /*!< [0xC] MCG Control 7 Register */
    __IO hw_mcg_c8_t C8;                   /*!< [0xD] MCG Control 8 Register */
    __I hw_mcg_c9_t C9;                    /*!< [0xE] MCG Control 9 Register */
    __I hw_mcg_c10_t C10;                  /*!< [0xF] MCG Control 10 Register */
} hw_mcg_t;
#pragma pack()

/*! @brief Macro to access all MCG registers. */
/*! @param x MCG module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_MCG_REGS(MCG_BASE)</code>. */
#define HW_MCG_REGS(x) (*(hw_mcg_t *)(x))

/* Backward compatibility */
#define BP_MCG_C2_EREFS          BP_MCG_C2_EREFS0
#define BM_MCG_C2_EREFS          BM_MCG_C2_EREFS0
#define BS_MCG_C2_EREFS          BS_MCG_C2_EREFS0
#define BR_MCG_C2_EREFS(x)       BR_MCG_C2_EREFS0(x)
#define BF_MCG_C2_EREFS(v)       BF_MCG_C2_EREFS0(v)
#define BW_MCG_C2_EREFS(x, v)    BW_MCG_C2_EREFS0(x, v)
#define BP_MCG_C2_HGO            BP_MCG_C2_HGO0
#define BM_MCG_C2_HGO            BM_MCG_C2_HGO0
#define BS_MCG_C2_HGO            BS_MCG_C2_HGO0
#define BR_MCG_C2_HGO(x)         BR_MCG_C2_HGO0(x)
#define BF_MCG_C2_HGO(v)         BF_MCG_C2_HGO0(v)
#define BW_MCG_C2_HGO(x, v)      BW_MCG_C2_HGO0(x, v)
#define BP_MCG_C2_RANGE          BP_MCG_C2_RANGE0
#define BM_MCG_C2_RANGE          BM_MCG_C2_RANGE0
#define BS_MCG_C2_RANGE          BS_MCG_C2_RANGE0
#define BR_MCG_C2_RANGE(x)       BR_MCG_C2_RANGE0(x)
#define BF_MCG_C2_RANGE(v)       BF_MCG_C2_RANGE0(v)
#define BW_MCG_C2_RANGE(x, v)    BW_MCG_C2_RANGE0(x, v)

