flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*
 * Constants & macros for individual MCM_PLACR bitfields
 */

/*!
 * @name Register MCM_PLACR, field ARB[9] (RW)
 *
 * Values:
 * - 0 - Fixed-priority arbitration for the crossbar masters
 * - 1 - Round-robin arbitration for the crossbar masters
 */
/*@{*/
#define BP_MCM_PLACR_ARB     (9U)          /*!< Bit position for MCM_PLACR_ARB. */
#define BM_MCM_PLACR_ARB     (0x00000200U) /*!< Bit mask for MCM_PLACR_ARB. */
#define BS_MCM_PLACR_ARB     (1U)          /*!< Bit field size in bits for MCM_PLACR_ARB. */

/*! @brief Read current value of the MCM_PLACR_ARB field. */
#define BR_MCM_PLACR_ARB(x)  (HW_MCM_PLACR(x).B.ARB)

/*! @brief Format value for bitfield MCM_PLACR_ARB. */
#define BF_MCM_PLACR_ARB(v)  ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_ARB) & BM_MCM_PLACR_ARB)

/*! @brief Set the ARB field to a new value. */
#define BW_MCM_PLACR_ARB(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_ARB) | BF_MCM_PLACR_ARB(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field CFCC[10] (WORZ)
 *
 * Writing a 1 to this field clears the cache. Writing a 0 to this field is
 * ignored. This field always reads as 0.
 */
/*@{*/
#define BP_MCM_PLACR_CFCC    (10U)         /*!< Bit position for MCM_PLACR_CFCC. */
#define BM_MCM_PLACR_CFCC    (0x00000400U) /*!< Bit mask for MCM_PLACR_CFCC. */
#define BS_MCM_PLACR_CFCC    (1U)          /*!< Bit field size in bits for MCM_PLACR_CFCC. */

/*! @brief Format value for bitfield MCM_PLACR_CFCC. */
#define BF_MCM_PLACR_CFCC(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_CFCC) & BM_MCM_PLACR_CFCC)

/*! @brief Set the CFCC field to a new value. */
#define BW_MCM_PLACR_CFCC(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_CFCC) | BF_MCM_PLACR_CFCC(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field DFCDA[11] (RW)
 *
 * This field is used to disable flash controller data caching.
 *
 * Values:
 * - 0 - Enable flash controller data caching
 * - 1 - Disable flash controller data caching.
 */
/*@{*/
#define BP_MCM_PLACR_DFCDA   (11U)         /*!< Bit position for MCM_PLACR_DFCDA. */
#define BM_MCM_PLACR_DFCDA   (0x00000800U) /*!< Bit mask for MCM_PLACR_DFCDA. */
#define BS_MCM_PLACR_DFCDA   (1U)          /*!< Bit field size in bits for MCM_PLACR_DFCDA. */

/*! @brief Read current value of the MCM_PLACR_DFCDA field. */
#define BR_MCM_PLACR_DFCDA(x) (HW_MCM_PLACR(x).B.DFCDA)

/*! @brief Format value for bitfield MCM_PLACR_DFCDA. */
#define BF_MCM_PLACR_DFCDA(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_DFCDA) & BM_MCM_PLACR_DFCDA)

/*! @brief Set the DFCDA field to a new value. */
#define BW_MCM_PLACR_DFCDA(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_DFCDA) | BF_MCM_PLACR_DFCDA(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field DFCIC[12] (RW)
 *
 * This field is used to disable flash controller instruction caching.
 *
 * Values:
 * - 0 - Enable flash controller instruction caching.
 * - 1 - Disable flash controller instruction caching.
 */
/*@{*/
#define BP_MCM_PLACR_DFCIC   (12U)         /*!< Bit position for MCM_PLACR_DFCIC. */
#define BM_MCM_PLACR_DFCIC   (0x00001000U) /*!< Bit mask for MCM_PLACR_DFCIC. */
#define BS_MCM_PLACR_DFCIC   (1U)          /*!< Bit field size in bits for MCM_PLACR_DFCIC. */

/*! @brief Read current value of the MCM_PLACR_DFCIC field. */
#define BR_MCM_PLACR_DFCIC(x) (HW_MCM_PLACR(x).B.DFCIC)

/*! @brief Format value for bitfield MCM_PLACR_DFCIC. */
#define BF_MCM_PLACR_DFCIC(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_DFCIC) & BM_MCM_PLACR_DFCIC)

/*! @brief Set the DFCIC field to a new value. */
#define BW_MCM_PLACR_DFCIC(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_DFCIC) | BF_MCM_PLACR_DFCIC(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field DFCC[13] (RW)
 *
 * This field is used to disable flash controller cache.
 *
 * Values:
 * - 0 - Enable flash controller cache.
 * - 1 - Disable flash controller cache.
 */
/*@{*/
#define BP_MCM_PLACR_DFCC    (13U)         /*!< Bit position for MCM_PLACR_DFCC. */
#define BM_MCM_PLACR_DFCC    (0x00002000U) /*!< Bit mask for MCM_PLACR_DFCC. */
#define BS_MCM_PLACR_DFCC    (1U)          /*!< Bit field size in bits for MCM_PLACR_DFCC. */

/*! @brief Read current value of the MCM_PLACR_DFCC field. */
#define BR_MCM_PLACR_DFCC(x) (HW_MCM_PLACR(x).B.DFCC)

/*! @brief Format value for bitfield MCM_PLACR_DFCC. */
#define BF_MCM_PLACR_DFCC(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_DFCC) & BM_MCM_PLACR_DFCC)

/*! @brief Set the DFCC field to a new value. */
#define BW_MCM_PLACR_DFCC(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_DFCC) | BF_MCM_PLACR_DFCC(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field EFDS[14] (RW)
 *
 * This field is used to enable flash data speculation.
 *
 * Values:
 * - 0 - Disable flash data speculation.
 * - 1 - Enable flash data speculation.
 */
/*@{*/
#define BP_MCM_PLACR_EFDS    (14U)         /*!< Bit position for MCM_PLACR_EFDS. */
#define BM_MCM_PLACR_EFDS    (0x00004000U) /*!< Bit mask for MCM_PLACR_EFDS. */
#define BS_MCM_PLACR_EFDS    (1U)          /*!< Bit field size in bits for MCM_PLACR_EFDS. */

/*! @brief Read current value of the MCM_PLACR_EFDS field. */
#define BR_MCM_PLACR_EFDS(x) (HW_MCM_PLACR(x).B.EFDS)

/*! @brief Format value for bitfield MCM_PLACR_EFDS. */
#define BF_MCM_PLACR_EFDS(v) ((uint32_t)((uint32_t)(v) << BP_MCM_PLACR_EFDS) & BM_MCM_PLACR_EFDS)

/*! @brief Set the EFDS field to a new value. */
#define BW_MCM_PLACR_EFDS(x, v) (HW_MCM_PLACR_WR(x, (HW_MCM_PLACR_RD(x) & ~BM_MCM_PLACR_EFDS) | BF_MCM_PLACR_EFDS(v)))
/*@}*/

/*!
 * @name Register MCM_PLACR, field DFCS[15] (RW)
 *
 * This field is used to disable flash controller speculation.
 *
 * Values:
 * - 0 - Enable flash controller speculation.
 * - 1 - Disable flash controller speculation.
 */
/*@{*/
#define BP_MCM_PLACR_DFCS    (15U)         /*!< Bit position for MCM_PLACR_DFCS. */
#define BM_MCM_PLACR_DFCS    (0x00008000U) /*!< Bit mask for MCM_PLACR_DFCS. */
#define BS_MCM_PLACR_DFCS    (1U)          /*!< Bit field size in bits for MCM_PLACR_DFCS. */

