flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*******************************************************************************
 * hw_tpm_t - module struct
 ******************************************************************************/
/*!
 * @brief All TPM module registers.
 */
#pragma pack(1)
typedef struct _hw_tpm
{
    __IO hw_tpm_sc_t SC;                   /*!< [0x0] Status and Control */
    __IO hw_tpm_cnt_t CNT;                 /*!< [0x4] Counter */
    __IO hw_tpm_mod_t MOD;                 /*!< [0x8] Modulo */
    struct {
        __IO hw_tpm_cnsc_t CnSC;           /*!< [0xC] Channel (n) Status and Control */
        __IO hw_tpm_cnv_t CnV;             /*!< [0x10] Channel (n) Value */
    } CONTROLS[6];
    uint8_t _reserved0[20];
    __IO hw_tpm_status_t STATUS;           /*!< [0x50] Capture and Compare Status */
    uint8_t _reserved1[48];
    __IO hw_tpm_conf_t CONF;               /*!< [0x84] Configuration */
} hw_tpm_t;
#pragma pack()

/*! @brief Macro to access all TPM registers. */
/*! @param x TPM module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_TPM_REGS(TPM0_BASE)</code>. */
#define HW_TPM_REGS(x) (*(hw_tpm_t *)(x))

/*
 * MKL25Z4 TSI
 *
 * Touch sense input
 *
 * Registers defined in this header file:
 * - HW_TSI_GENCS - TSI General Control and Status Register
 * - HW_TSI_DATA - TSI DATA Register
 * - HW_TSI_TSHD - TSI Threshold Register
 *
 * - hw_tsi_t - Struct containing all module registers.
 */

#define HW_TSI_INSTANCE_COUNT (1U) /*!< Number of instances of the TSI module. */
#define HW_TSI0 (0U) /*!< Instance number for TSI0. */

/*******************************************************************************
 * HW_TSI_GENCS - TSI General Control and Status Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_GENCS - TSI General Control and Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This control register provides various control and configuration information
 * for the TSI module. When TSI is working, the configuration bits (GENCS[TSIEN],
 * GENCS[TSIIEN], and GENCS[STM]) must not be changed. The EOSF flag is kept
 * until the software acknowledge it.
 */
typedef union _hw_tsi_gencs
{
    uint32_t U;
    struct _hw_tsi_gencs_bitfields
    {
        uint32_t RESERVED0 : 1;        /*!< [0]  */
        uint32_t CURSW : 1;            /*!< [1] CURSW */
        uint32_t EOSF : 1;             /*!< [2] End of Scan Flag */
        uint32_t SCNIP : 1;            /*!< [3] Scan In Progress Status */
        uint32_t STM : 1;              /*!< [4] Scan Trigger Mode */
        uint32_t STPE : 1;             /*!< [5] TSI STOP Enable */
        uint32_t TSIIEN : 1;           /*!< [6] Touch Sensing Input Interrupt Enable */
        uint32_t TSIEN : 1;            /*!< [7] Touch Sensing Input Module Enable */
        uint32_t NSCN : 5;             /*!< [12:8] NSCN */
        uint32_t PS : 3;               /*!< [15:13] PS */
        uint32_t EXTCHRG : 3;          /*!< [18:16] EXTCHRG */
        uint32_t DVOLT : 2;            /*!< [20:19] DVOLT */
        uint32_t REFCHRG : 3;          /*!< [23:21] REFCHRG */
        uint32_t MODE : 4;             /*!< [27:24] TSI analog modes setup and status
                                        * bits. */
        uint32_t ESOR : 1;             /*!< [28] End-of-scan or Out-of-Range Interrupt
                                        * Selection */
        uint32_t RESERVED1 : 2;        /*!< [30:29]  */
        uint32_t OUTRGF : 1;           /*!< [31] Out of Range Flag. */
    } B;
} hw_tsi_gencs_t;

/*!
 * @name Constants and macros for entire TSI_GENCS register
 */
/*@{*/
#define HW_TSI_GENCS_ADDR(x)     ((uint32_t)(x) + 0x0U)

#define HW_TSI_GENCS(x)          (*(__IO hw_tsi_gencs_t *) HW_TSI_GENCS_ADDR(x))
#define HW_TSI_GENCS_RD(x)       (HW_TSI_GENCS(x).U)
#define HW_TSI_GENCS_WR(x, v)    (HW_TSI_GENCS(x).U = (v))
#define HW_TSI_GENCS_SET(x, v)   (BME_OR32(HW_TSI_GENCS_ADDR(x), (uint32_t)(v)))
#define HW_TSI_GENCS_CLR(x, v)   (BME_AND32(HW_TSI_GENCS_ADDR(x), (uint32_t)(~(v))))
#define HW_TSI_GENCS_TOG(x, v)   (BME_XOR32(HW_TSI_GENCS_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual TSI_GENCS bitfields
 */

/*!
 * @name Register TSI_GENCS, field CURSW[1] (RW)
 *
 * This bit specifies if the current sources of electrode oscillator and
 * reference oscillator are swapped.
 *
 * Values:
 * - 0 - The current source pair are not swapped.
 * - 1 - The current source pair are swapped.
 */
/*@{*/
#define BP_TSI_GENCS_CURSW   (1U)          /*!< Bit position for TSI_GENCS_CURSW. */
#define BM_TSI_GENCS_CURSW   (0x00000002U) /*!< Bit mask for TSI_GENCS_CURSW. */
#define BS_TSI_GENCS_CURSW   (1U)          /*!< Bit field size in bits for TSI_GENCS_CURSW. */

/*! @brief Read current value of the TSI_GENCS_CURSW field. */
#define BR_TSI_GENCS_CURSW(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_CURSW, BS_TSI_GENCS_CURSW))

/*! @brief Format value for bitfield TSI_GENCS_CURSW. */
#define BF_TSI_GENCS_CURSW(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_CURSW) & BM_TSI_GENCS_CURSW)

/*! @brief Set the CURSW field to a new value. */
#define BW_TSI_GENCS_CURSW(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_CURSW), BP_TSI_GENCS_CURSW, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EOSF[2] (W1C)
 *
 * This flag is set when all active electrodes are finished scanning after a
 * scan trigger. Write "1" , when this flag is set, to clear it.
 *
 * Values:
 * - 0 - Scan not complete.
 * - 1 - Scan complete.
 */
/*@{*/
#define BP_TSI_GENCS_EOSF    (2U)          /*!< Bit position for TSI_GENCS_EOSF. */
#define BM_TSI_GENCS_EOSF    (0x00000004U) /*!< Bit mask for TSI_GENCS_EOSF. */
#define BS_TSI_GENCS_EOSF    (1U)          /*!< Bit field size in bits for TSI_GENCS_EOSF. */

/*! @brief Read current value of the TSI_GENCS_EOSF field. */
#define BR_TSI_GENCS_EOSF(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_EOSF, BS_TSI_GENCS_EOSF))

/*! @brief Format value for bitfield TSI_GENCS_EOSF. */
#define BF_TSI_GENCS_EOSF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_EOSF) & BM_TSI_GENCS_EOSF)

/*! @brief Set the EOSF field to a new value. */
#define BW_TSI_GENCS_EOSF(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_EOSF), BP_TSI_GENCS_EOSF, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field SCNIP[3] (RO)
 *
 * This read-only bit indicates if scan is in progress. This bit will get
 * asserted after the analog bias circuit is stable after a trigger and it changes
 * automatically by the TSI.
 *
 * Values:
 * - 0 - No scan in progress.
 * - 1 - Scan in progress.
 */
/*@{*/
#define BP_TSI_GENCS_SCNIP   (3U)          /*!< Bit position for TSI_GENCS_SCNIP. */
#define BM_TSI_GENCS_SCNIP   (0x00000008U) /*!< Bit mask for TSI_GENCS_SCNIP. */
#define BS_TSI_GENCS_SCNIP   (1U)          /*!< Bit field size in bits for TSI_GENCS_SCNIP. */

/*! @brief Read current value of the TSI_GENCS_SCNIP field. */
#define BR_TSI_GENCS_SCNIP(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_SCNIP, BS_TSI_GENCS_SCNIP))
/*@}*/

/*!
 * @name Register TSI_GENCS, field STM[4] (RW)
 *
 * This bit specifies the trigger mode. User is allowed to change this bit when
 * TSI is not working in progress.
 *
 * Values:
 * - 0 - Software trigger scan.
 * - 1 - Hardware trigger scan.
 */
/*@{*/
#define BP_TSI_GENCS_STM     (4U)          /*!< Bit position for TSI_GENCS_STM. */
#define BM_TSI_GENCS_STM     (0x00000010U) /*!< Bit mask for TSI_GENCS_STM. */
#define BS_TSI_GENCS_STM     (1U)          /*!< Bit field size in bits for TSI_GENCS_STM. */

