flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*! @brief Format value for bitfield TSI_GENCS_EXTCHRG. */
#define BF_TSI_GENCS_EXTCHRG(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_EXTCHRG) & BM_TSI_GENCS_EXTCHRG)

/*! @brief Set the EXTCHRG field to a new value. */
#define BW_TSI_GENCS_EXTCHRG(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_EXTCHRG), BP_TSI_GENCS_EXTCHRG, 3))
/*@}*/

/*!
 * @name Register TSI_GENCS, field DVOLT[20:19] (RW)
 *
 * These bits indicate the oscillator's voltage rails as below.
 *
 * Values:
 * - 00 - DV = 1.03 V; VP = 1.33 V; Vm = 0.30 V.
 * - 01 - DV = 0.73 V; VP = 1.18 V; Vm = 0.45 V.
 * - 10 - DV = 0.43 V; VP = 1.03 V; Vm = 0.60 V.
 * - 11 - DV = 0.29 V; VP = 0.95 V; Vm = 0.67 V.
 */
/*@{*/
#define BP_TSI_GENCS_DVOLT   (19U)         /*!< Bit position for TSI_GENCS_DVOLT. */
#define BM_TSI_GENCS_DVOLT   (0x00180000U) /*!< Bit mask for TSI_GENCS_DVOLT. */
#define BS_TSI_GENCS_DVOLT   (2U)          /*!< Bit field size in bits for TSI_GENCS_DVOLT. */

/*! @brief Read current value of the TSI_GENCS_DVOLT field. */
#define BR_TSI_GENCS_DVOLT(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_DVOLT, BS_TSI_GENCS_DVOLT))

/*! @brief Format value for bitfield TSI_GENCS_DVOLT. */
#define BF_TSI_GENCS_DVOLT(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_DVOLT) & BM_TSI_GENCS_DVOLT)

/*! @brief Set the DVOLT field to a new value. */
#define BW_TSI_GENCS_DVOLT(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_DVOLT), BP_TSI_GENCS_DVOLT, 2))
/*@}*/

/*!
 * @name Register TSI_GENCS, field REFCHRG[23:21] (RW)
 *
 * These bits indicate the reference oscillator charge and discharge current
 * value.
 *
 * Values:
 * - 000 - 500 nA.
 * - 001 - 1 uA.
 * - 010 - 2 uA.
 * - 011 - 4 uA.
 * - 100 - 8 uA.
 * - 101 - 16 uA.
 * - 110 - 32 uA.
 * - 111 - 64 uA.
 */
/*@{*/
#define BP_TSI_GENCS_REFCHRG (21U)         /*!< Bit position for TSI_GENCS_REFCHRG. */
#define BM_TSI_GENCS_REFCHRG (0x00E00000U) /*!< Bit mask for TSI_GENCS_REFCHRG. */
#define BS_TSI_GENCS_REFCHRG (3U)          /*!< Bit field size in bits for TSI_GENCS_REFCHRG. */

/*! @brief Read current value of the TSI_GENCS_REFCHRG field. */
#define BR_TSI_GENCS_REFCHRG(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_REFCHRG, BS_TSI_GENCS_REFCHRG))

/*! @brief Format value for bitfield TSI_GENCS_REFCHRG. */
#define BF_TSI_GENCS_REFCHRG(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_REFCHRG) & BM_TSI_GENCS_REFCHRG)

/*! @brief Set the REFCHRG field to a new value. */
#define BW_TSI_GENCS_REFCHRG(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_REFCHRG), BP_TSI_GENCS_REFCHRG, 3))
/*@}*/

/*!
 * @name Register TSI_GENCS, field MODE[27:24] (RW)
 *
 * Set up TSI analog modes, especially, setting MODE[3:2] to not 2'b00 will
 * configure TSI to noise detection modes. MODE[1:0] take no effect on TSI operation
 * mode and should always write to 2'b00 for setting up. When reading this field
 * will return the analog status. Refer to chapter "Noise detection mode" for
 * details.
 *
 * Values:
 * - 0000 - Set TSI in capacitive sensing(non-noise detection) mode.
 * - 0100 - Set TSI analog to work in single threshold noise detection mode and
 *     the frequency limitation circuit is disabled.
 * - 1000 - Set TSI analog to work in single threshold noise detection mode and
 *     the frequency limitation circuit is enabled to work in higher frequencies
 *     operations.
 * - 1100 - Set TSI analog to work in automatic noise detection mode.
 */
/*@{*/
#define BP_TSI_GENCS_MODE    (24U)         /*!< Bit position for TSI_GENCS_MODE. */
#define BM_TSI_GENCS_MODE    (0x0F000000U) /*!< Bit mask for TSI_GENCS_MODE. */
#define BS_TSI_GENCS_MODE    (4U)          /*!< Bit field size in bits for TSI_GENCS_MODE. */

/*! @brief Read current value of the TSI_GENCS_MODE field. */
#define BR_TSI_GENCS_MODE(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_MODE, BS_TSI_GENCS_MODE))

/*! @brief Format value for bitfield TSI_GENCS_MODE. */
#define BF_TSI_GENCS_MODE(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_MODE) & BM_TSI_GENCS_MODE)

/*! @brief Set the MODE field to a new value. */
#define BW_TSI_GENCS_MODE(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_MODE), BP_TSI_GENCS_MODE, 4))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ESOR[28] (RW)
 *
 * This bit is used to select out-of-range or end-of-scan event to generate an
 * interrupt.
 *
 * Values:
 * - 0 - Out-of-range interrupt is allowed.
 * - 1 - End-of-scan interrupt is allowed.
 */
/*@{*/
#define BP_TSI_GENCS_ESOR    (28U)         /*!< Bit position for TSI_GENCS_ESOR. */
#define BM_TSI_GENCS_ESOR    (0x10000000U) /*!< Bit mask for TSI_GENCS_ESOR. */
#define BS_TSI_GENCS_ESOR    (1U)          /*!< Bit field size in bits for TSI_GENCS_ESOR. */

/*! @brief Read current value of the TSI_GENCS_ESOR field. */
#define BR_TSI_GENCS_ESOR(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_ESOR, BS_TSI_GENCS_ESOR))

/*! @brief Format value for bitfield TSI_GENCS_ESOR. */
#define BF_TSI_GENCS_ESOR(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_ESOR) & BM_TSI_GENCS_ESOR)

/*! @brief Set the ESOR field to a new value. */
#define BW_TSI_GENCS_ESOR(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_ESOR), BP_TSI_GENCS_ESOR, 1))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OUTRGF[31] (W1C)
 *
 * This flag is set if the result register of the enabled electrode is out of
 * the range defined by the TSI_THRESHOLD register. This flag is set only when TSI
 * is configured in non-noise detection mode. It can be read once the CPU wakes.
 * Write "1" , when this flag is set, to clear it.
 */
/*@{*/
#define BP_TSI_GENCS_OUTRGF  (31U)         /*!< Bit position for TSI_GENCS_OUTRGF. */
#define BM_TSI_GENCS_OUTRGF  (0x80000000U) /*!< Bit mask for TSI_GENCS_OUTRGF. */
#define BS_TSI_GENCS_OUTRGF  (1U)          /*!< Bit field size in bits for TSI_GENCS_OUTRGF. */

/*! @brief Read current value of the TSI_GENCS_OUTRGF field. */
#define BR_TSI_GENCS_OUTRGF(x) (BME_UBFX32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_OUTRGF, BS_TSI_GENCS_OUTRGF))

