flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*! @brief Format value for bitfield TSI_GENCS_OUTRGF. */
#define BF_TSI_GENCS_OUTRGF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_OUTRGF) & BM_TSI_GENCS_OUTRGF)

/*! @brief Set the OUTRGF field to a new value. */
#define BW_TSI_GENCS_OUTRGF(x, v) (BME_BFI32(HW_TSI_GENCS_ADDR(x), ((uint32_t)(v) << BP_TSI_GENCS_OUTRGF), BP_TSI_GENCS_OUTRGF, 1))
/*@}*/

/*******************************************************************************
 * HW_TSI_DATA - TSI DATA Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_DATA - TSI DATA Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_data
{
    uint32_t U;
    struct _hw_tsi_data_bitfields
    {
        uint32_t TSICNT : 16;          /*!< [15:0] TSI Conversion Counter Value */
        uint32_t RESERVED0 : 6;        /*!< [21:16]  */
        uint32_t SWTS : 1;             /*!< [22] Software Trigger Start */
        uint32_t DMAEN : 1;            /*!< [23] DMA Transfer Enabled */
        uint32_t RESERVED1 : 4;        /*!< [27:24]  */
        uint32_t TSICH : 4;            /*!< [31:28] TSICH */
    } B;
} hw_tsi_data_t;

/*!
 * @name Constants and macros for entire TSI_DATA register
 */
/*@{*/
#define HW_TSI_DATA_ADDR(x)      ((uint32_t)(x) + 0x4U)

#define HW_TSI_DATA(x)           (*(__IO hw_tsi_data_t *) HW_TSI_DATA_ADDR(x))
#define HW_TSI_DATA_RD(x)        (HW_TSI_DATA(x).U)
#define HW_TSI_DATA_WR(x, v)     (HW_TSI_DATA(x).U = (v))
#define HW_TSI_DATA_SET(x, v)    (BME_OR32(HW_TSI_DATA_ADDR(x), (uint32_t)(v)))
#define HW_TSI_DATA_CLR(x, v)    (BME_AND32(HW_TSI_DATA_ADDR(x), (uint32_t)(~(v))))
#define HW_TSI_DATA_TOG(x, v)    (BME_XOR32(HW_TSI_DATA_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual TSI_DATA bitfields
 */

/*!
 * @name Register TSI_DATA, field TSICNT[15:0] (RO)
 *
 * These read-only bits record the accumulated scan counter value ticked by the
 * reference oscillator.
 */
/*@{*/
#define BP_TSI_DATA_TSICNT   (0U)          /*!< Bit position for TSI_DATA_TSICNT. */
#define BM_TSI_DATA_TSICNT   (0x0000FFFFU) /*!< Bit mask for TSI_DATA_TSICNT. */
#define BS_TSI_DATA_TSICNT   (16U)         /*!< Bit field size in bits for TSI_DATA_TSICNT. */

/*! @brief Read current value of the TSI_DATA_TSICNT field. */
#define BR_TSI_DATA_TSICNT(x) (BME_UBFX32(HW_TSI_DATA_ADDR(x), BP_TSI_DATA_TSICNT, BS_TSI_DATA_TSICNT))
/*@}*/

/*!
 * @name Register TSI_DATA, field SWTS[22] (WORZ)
 *
 * This write-only bit is a software start trigger. When STM bit is clear, write
 * "1" to this bit will start a scan. The electrode channel to be scanned is
 * determinated by TSI_DATA[TSICH] bits.
 *
 * Values:
 * - 0 - No effect.
 * - 1 - Start a scan to determine which channel is specified by TSI_DATA[TSICH].
 */
/*@{*/
#define BP_TSI_DATA_SWTS     (22U)         /*!< Bit position for TSI_DATA_SWTS. */
#define BM_TSI_DATA_SWTS     (0x00400000U) /*!< Bit mask for TSI_DATA_SWTS. */
#define BS_TSI_DATA_SWTS     (1U)          /*!< Bit field size in bits for TSI_DATA_SWTS. */

/*! @brief Format value for bitfield TSI_DATA_SWTS. */
#define BF_TSI_DATA_SWTS(v)  ((uint32_t)((uint32_t)(v) << BP_TSI_DATA_SWTS) & BM_TSI_DATA_SWTS)

/*! @brief Set the SWTS field to a new value. */
#define BW_TSI_DATA_SWTS(x, v) (BME_BFI32(HW_TSI_DATA_ADDR(x), ((uint32_t)(v) << BP_TSI_DATA_SWTS), BP_TSI_DATA_SWTS, 1))
/*@}*/

/*!
 * @name Register TSI_DATA, field DMAEN[23] (RW)
 *
 * This bit is used together with the TSI interrupt enable bits(TSIIE, ESOR) to
 * generate a DMA transfer request instead of an interrupt.
 *
 * Values:
 * - 0 - Interrupt is selected when the interrupt enable bit is set and the
 *     corresponding TSI events assert.
 * - 1 - DMA transfer request is selected when the interrupt enable bit is set
 *     and the corresponding TSI events assert.
 */
/*@{*/
#define BP_TSI_DATA_DMAEN    (23U)         /*!< Bit position for TSI_DATA_DMAEN. */
#define BM_TSI_DATA_DMAEN    (0x00800000U) /*!< Bit mask for TSI_DATA_DMAEN. */
#define BS_TSI_DATA_DMAEN    (1U)          /*!< Bit field size in bits for TSI_DATA_DMAEN. */

/*! @brief Read current value of the TSI_DATA_DMAEN field. */
#define BR_TSI_DATA_DMAEN(x) (BME_UBFX32(HW_TSI_DATA_ADDR(x), BP_TSI_DATA_DMAEN, BS_TSI_DATA_DMAEN))

/*! @brief Format value for bitfield TSI_DATA_DMAEN. */
#define BF_TSI_DATA_DMAEN(v) ((uint32_t)((uint32_t)(v) << BP_TSI_DATA_DMAEN) & BM_TSI_DATA_DMAEN)

/*! @brief Set the DMAEN field to a new value. */
#define BW_TSI_DATA_DMAEN(x, v) (BME_BFI32(HW_TSI_DATA_ADDR(x), ((uint32_t)(v) << BP_TSI_DATA_DMAEN), BP_TSI_DATA_DMAEN, 1))
/*@}*/

/*!
 * @name Register TSI_DATA, field TSICH[31:28] (RW)
 *
 * These bits specify current channel to be measured. In hardware trigger mode
 * (TSI_GENCS[STM] = 1), the scan will not start until the hardware trigger
 * occurs. In software trigger mode (TSI_GENCS[STM] = 0), the scan starts immediately
 * when TSI_DATA[SWTS] bit is written by 1.
 *
 * Values:
 * - 0000 - Channel 0.
 * - 0001 - Channel 1.
 * - 0010 - Channel 2.
 * - 0011 - Channel 3.
 * - 0100 - Channel 4.
 * - 0101 - Channel 5.
 * - 0110 - Channel 6.
 * - 0111 - Channel 7.
 * - 1000 - Channel 8.
 * - 1001 - Channel 9.
 * - 1010 - Channel 10.
 * - 1011 - Channel 11.
 * - 1100 - Channel 12.
 * - 1101 - Channel 13.
 * - 1110 - Channel 14.
 * - 1111 - Channel 15.
 */
/*@{*/
#define BP_TSI_DATA_TSICH    (28U)         /*!< Bit position for TSI_DATA_TSICH. */
#define BM_TSI_DATA_TSICH    (0xF0000000U) /*!< Bit mask for TSI_DATA_TSICH. */
#define BS_TSI_DATA_TSICH    (4U)          /*!< Bit field size in bits for TSI_DATA_TSICH. */

/*! @brief Read current value of the TSI_DATA_TSICH field. */
#define BR_TSI_DATA_TSICH(x) (BME_UBFX32(HW_TSI_DATA_ADDR(x), BP_TSI_DATA_TSICH, BS_TSI_DATA_TSICH))

/*! @brief Format value for bitfield TSI_DATA_TSICH. */
#define BF_TSI_DATA_TSICH(v) ((uint32_t)((uint32_t)(v) << BP_TSI_DATA_TSICH) & BM_TSI_DATA_TSICH)

/*! @brief Set the TSICH field to a new value. */
#define BW_TSI_DATA_TSICH(x, v) (BME_BFI32(HW_TSI_DATA_ADDR(x), ((uint32_t)(v) << BP_TSI_DATA_TSICH), BP_TSI_DATA_TSICH, 4))
/*@}*/

