flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*******************************************************************************
 * HW_TSI_TSHD - TSI Threshold Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_TSHD - TSI Threshold Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_tshd
{
    uint32_t U;
    struct _hw_tsi_tshd_bitfields
    {
        uint32_t THRESL : 16;          /*!< [15:0] TSI Wakeup Channel Low-threshold */
        uint32_t THRESH : 16;          /*!< [31:16] TSI Wakeup Channel High-threshold
                                        * */
    } B;
} hw_tsi_tshd_t;

/*!
 * @name Constants and macros for entire TSI_TSHD register
 */
/*@{*/
#define HW_TSI_TSHD_ADDR(x)      ((uint32_t)(x) + 0x8U)

#define HW_TSI_TSHD(x)           (*(__IO hw_tsi_tshd_t *) HW_TSI_TSHD_ADDR(x))
#define HW_TSI_TSHD_RD(x)        (HW_TSI_TSHD(x).U)
#define HW_TSI_TSHD_WR(x, v)     (HW_TSI_TSHD(x).U = (v))
#define HW_TSI_TSHD_SET(x, v)    (BME_OR32(HW_TSI_TSHD_ADDR(x), (uint32_t)(v)))
#define HW_TSI_TSHD_CLR(x, v)    (BME_AND32(HW_TSI_TSHD_ADDR(x), (uint32_t)(~(v))))
#define HW_TSI_TSHD_TOG(x, v)    (BME_XOR32(HW_TSI_TSHD_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual TSI_TSHD bitfields
 */

/*!
 * @name Register TSI_TSHD, field THRESL[15:0] (RW)
 *
 * This half-word specifies the low threshold of the wakeup channel.
 */
/*@{*/
#define BP_TSI_TSHD_THRESL   (0U)          /*!< Bit position for TSI_TSHD_THRESL. */
#define BM_TSI_TSHD_THRESL   (0x0000FFFFU) /*!< Bit mask for TSI_TSHD_THRESL. */
#define BS_TSI_TSHD_THRESL   (16U)         /*!< Bit field size in bits for TSI_TSHD_THRESL. */

/*! @brief Read current value of the TSI_TSHD_THRESL field. */
#define BR_TSI_TSHD_THRESL(x) (BME_UBFX32(HW_TSI_TSHD_ADDR(x), BP_TSI_TSHD_THRESL, BS_TSI_TSHD_THRESL))

/*! @brief Format value for bitfield TSI_TSHD_THRESL. */
#define BF_TSI_TSHD_THRESL(v) ((uint32_t)((uint32_t)(v) << BP_TSI_TSHD_THRESL) & BM_TSI_TSHD_THRESL)

/*! @brief Set the THRESL field to a new value. */
#define BW_TSI_TSHD_THRESL(x, v) (BME_BFI32(HW_TSI_TSHD_ADDR(x), ((uint32_t)(v) << BP_TSI_TSHD_THRESL), BP_TSI_TSHD_THRESL, 16))
/*@}*/

/*!
 * @name Register TSI_TSHD, field THRESH[31:16] (RW)
 *
 * This half-word specifies the high threshold of the wakeup channel.
 */
/*@{*/
#define BP_TSI_TSHD_THRESH   (16U)         /*!< Bit position for TSI_TSHD_THRESH. */
#define BM_TSI_TSHD_THRESH   (0xFFFF0000U) /*!< Bit mask for TSI_TSHD_THRESH. */
#define BS_TSI_TSHD_THRESH   (16U)         /*!< Bit field size in bits for TSI_TSHD_THRESH. */

/*! @brief Read current value of the TSI_TSHD_THRESH field. */
#define BR_TSI_TSHD_THRESH(x) (BME_UBFX32(HW_TSI_TSHD_ADDR(x), BP_TSI_TSHD_THRESH, BS_TSI_TSHD_THRESH))

/*! @brief Format value for bitfield TSI_TSHD_THRESH. */
#define BF_TSI_TSHD_THRESH(v) ((uint32_t)((uint32_t)(v) << BP_TSI_TSHD_THRESH) & BM_TSI_TSHD_THRESH)

/*! @brief Set the THRESH field to a new value. */
#define BW_TSI_TSHD_THRESH(x, v) (BME_BFI32(HW_TSI_TSHD_ADDR(x), ((uint32_t)(v) << BP_TSI_TSHD_THRESH), BP_TSI_TSHD_THRESH, 16))
/*@}*/

/*******************************************************************************
 * hw_tsi_t - module struct
 ******************************************************************************/
/*!
 * @brief All TSI module registers.
 */
#pragma pack(1)
typedef struct _hw_tsi
{
    __IO hw_tsi_gencs_t GENCS;             /*!< [0x0] TSI General Control and Status Register */
    __IO hw_tsi_data_t DATA;               /*!< [0x4] TSI DATA Register */
    __IO hw_tsi_tshd_t TSHD;               /*!< [0x8] TSI Threshold Register */
} hw_tsi_t;
#pragma pack()

/*! @brief Macro to access all TSI registers. */
/*! @param x TSI module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_TSI_REGS(TSI0_BASE)</code>. */
#define HW_TSI_REGS(x) (*(hw_tsi_t *)(x))

/*
 * MKL25Z4 UART
 *
 * Universal Asynchronous Receiver/Transmitter (UART)
 *
 * Registers defined in this header file:
 * - HW_UART_BDH - UART Baud Rate Register: High
 * - HW_UART_BDL - UART Baud Rate Register: Low
 * - HW_UART_C1 - UART Control Register 1
 * - HW_UART_C2 - UART Control Register 2
 * - HW_UART_S1 - UART Status Register 1
 * - HW_UART_S2 - UART Status Register 2
 * - HW_UART_C3 - UART Control Register 3
 * - HW_UART_D - UART Data Register
 * - HW_UART_C4 - UART Control Register 4
 *
 * - hw_uart_t - Struct containing all module registers.
 */

#define HW_UART_INSTANCE_COUNT (2U) /*!< Number of instances of the UART module. */
#define HW_UART1 (1U) /*!< Instance number for UART1. */
#define HW_UART2 (2U) /*!< Instance number for UART2. */

/*******************************************************************************
 * HW_UART_BDH - UART Baud Rate Register: High
 ******************************************************************************/

/*!
 * @brief HW_UART_BDH - UART Baud Rate Register: High (RW)
 *
 * Reset value: 0x00U
 *
 * This register, along with UART_BDL, controls the prescale divisor for UART
 * baud rate generation. To update the 13-bit baud rate setting [SBR12:SBR0], first
 * write to UART_BDH to buffer the high half of the new value and then write to
 * UART_BDL. The working value in UART_BDH does not change until UART_BDL is
 * written.
 */
typedef union _hw_uart_bdh
{
    uint8_t U;
    struct _hw_uart_bdh_bitfields
    {
        uint8_t SBR : 5;               /*!< [4:0] Baud Rate Modulo Divisor. */
        uint8_t SBNS : 1;              /*!< [5] Stop Bit Number Select */
        uint8_t RXEDGIE : 1;           /*!< [6] RxD Input Active Edge Interrupt Enable
                                        * (for RXEDGIF) */
        uint8_t LBKDIE : 1;            /*!< [7] LIN Break Detect Interrupt Enable (for
                                        * LBKDIF) */
    } B;
} hw_uart_bdh_t;

/*!
 * @name Constants and macros for entire UART_BDH register
 */
/*@{*/
#define HW_UART_BDH_ADDR(x)      ((uint32_t)(x) + 0x0U)

#define HW_UART_BDH(x)           (*(__IO hw_uart_bdh_t *) HW_UART_BDH_ADDR(x))
#define HW_UART_BDH_RD(x)        (HW_UART_BDH(x).U)
#define HW_UART_BDH_WR(x, v)     (HW_UART_BDH(x).U = (v))
#define HW_UART_BDH_SET(x, v)    (BME_OR8(HW_UART_BDH_ADDR(x), (uint8_t)(v)))
#define HW_UART_BDH_CLR(x, v)    (BME_AND8(HW_UART_BDH_ADDR(x), (uint8_t)(~(v))))
#define HW_UART_BDH_TOG(x, v)    (BME_XOR8(HW_UART_BDH_ADDR(x), (uint8_t)(v)))
/*@}*/

