flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*******************************************************************************
 * HW_UART_D - UART Data Register
 ******************************************************************************/

/*!
 * @brief HW_UART_D - UART Data Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register is actually two separate registers. Reads return the contents
 * of the read-only receive data buffer and writes go to the write-only transmit
 * data buffer. Reads and writes of this register are also involved in the
 * automatic flag clearing mechanisms for the UART status flags.
 */
typedef union _hw_uart_d
{
    uint8_t U;
    struct _hw_uart_d_bitfields
    {
        uint8_t R0T0 : 1;              /*!< [0]  */
        uint8_t R1T1 : 1;              /*!< [1]  */
        uint8_t R2T2 : 1;              /*!< [2]  */
        uint8_t R3T3 : 1;              /*!< [3]  */
        uint8_t R4T4 : 1;              /*!< [4]  */
        uint8_t R5T5 : 1;              /*!< [5]  */
        uint8_t R6T6 : 1;              /*!< [6]  */
        uint8_t R7T7 : 1;              /*!< [7]  */
    } B;
} hw_uart_d_t;

/*!
 * @name Constants and macros for entire UART_D register
 */
/*@{*/
#define HW_UART_D_ADDR(x)        ((uint32_t)(x) + 0x7U)

#define HW_UART_D(x)             (*(__IO hw_uart_d_t *) HW_UART_D_ADDR(x))
#define HW_UART_D_RD(x)          (HW_UART_D(x).U)
#define HW_UART_D_WR(x, v)       (HW_UART_D(x).U = (v))
#define HW_UART_D_SET(x, v)      (BME_OR8(HW_UART_D_ADDR(x), (uint8_t)(v)))
#define HW_UART_D_CLR(x, v)      (BME_AND8(HW_UART_D_ADDR(x), (uint8_t)(~(v))))
#define HW_UART_D_TOG(x, v)      (BME_XOR8(HW_UART_D_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART_D bitfields
 */

/*!
 * @name Register UART_D, field R0T0[0] (RW)
 *
 * Read receive data buffer 0 or write transmit data buffer 0.
 */
/*@{*/
#define BP_UART_D_R0T0       (0U)          /*!< Bit position for UART_D_R0T0. */
#define BM_UART_D_R0T0       (0x01U)       /*!< Bit mask for UART_D_R0T0. */
#define BS_UART_D_R0T0       (1U)          /*!< Bit field size in bits for UART_D_R0T0. */

/*! @brief Read current value of the UART_D_R0T0 field. */
#define BR_UART_D_R0T0(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R0T0, BS_UART_D_R0T0))

/*! @brief Format value for bitfield UART_D_R0T0. */
#define BF_UART_D_R0T0(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R0T0) & BM_UART_D_R0T0)

/*! @brief Set the R0T0 field to a new value. */
#define BW_UART_D_R0T0(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R0T0), BP_UART_D_R0T0, 1))
/*@}*/

/*!
 * @name Register UART_D, field R1T1[1] (RW)
 *
 * Read receive data buffer 1 or write transmit data buffer 1.
 */
/*@{*/
#define BP_UART_D_R1T1       (1U)          /*!< Bit position for UART_D_R1T1. */
#define BM_UART_D_R1T1       (0x02U)       /*!< Bit mask for UART_D_R1T1. */
#define BS_UART_D_R1T1       (1U)          /*!< Bit field size in bits for UART_D_R1T1. */

/*! @brief Read current value of the UART_D_R1T1 field. */
#define BR_UART_D_R1T1(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R1T1, BS_UART_D_R1T1))

/*! @brief Format value for bitfield UART_D_R1T1. */
#define BF_UART_D_R1T1(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R1T1) & BM_UART_D_R1T1)

/*! @brief Set the R1T1 field to a new value. */
#define BW_UART_D_R1T1(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R1T1), BP_UART_D_R1T1, 1))
/*@}*/

/*!
 * @name Register UART_D, field R2T2[2] (RW)
 *
 * Read receive data buffer 2 or write transmit data buffer 2.
 */
/*@{*/
#define BP_UART_D_R2T2       (2U)          /*!< Bit position for UART_D_R2T2. */
#define BM_UART_D_R2T2       (0x04U)       /*!< Bit mask for UART_D_R2T2. */
#define BS_UART_D_R2T2       (1U)          /*!< Bit field size in bits for UART_D_R2T2. */

/*! @brief Read current value of the UART_D_R2T2 field. */
#define BR_UART_D_R2T2(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R2T2, BS_UART_D_R2T2))

/*! @brief Format value for bitfield UART_D_R2T2. */
#define BF_UART_D_R2T2(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R2T2) & BM_UART_D_R2T2)

/*! @brief Set the R2T2 field to a new value. */
#define BW_UART_D_R2T2(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R2T2), BP_UART_D_R2T2, 1))
/*@}*/

/*!
 * @name Register UART_D, field R3T3[3] (RW)
 *
 * Read receive data buffer 3 or write transmit data buffer 3.
 */
/*@{*/
#define BP_UART_D_R3T3       (3U)          /*!< Bit position for UART_D_R3T3. */
#define BM_UART_D_R3T3       (0x08U)       /*!< Bit mask for UART_D_R3T3. */
#define BS_UART_D_R3T3       (1U)          /*!< Bit field size in bits for UART_D_R3T3. */

/*! @brief Read current value of the UART_D_R3T3 field. */
#define BR_UART_D_R3T3(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R3T3, BS_UART_D_R3T3))

/*! @brief Format value for bitfield UART_D_R3T3. */
#define BF_UART_D_R3T3(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R3T3) & BM_UART_D_R3T3)

/*! @brief Set the R3T3 field to a new value. */
#define BW_UART_D_R3T3(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R3T3), BP_UART_D_R3T3, 1))
/*@}*/

/*!
 * @name Register UART_D, field R4T4[4] (RW)
 *
 * Read receive data buffer 4 or write transmit data buffer 4.
 */
/*@{*/
#define BP_UART_D_R4T4       (4U)          /*!< Bit position for UART_D_R4T4. */
#define BM_UART_D_R4T4       (0x10U)       /*!< Bit mask for UART_D_R4T4. */
#define BS_UART_D_R4T4       (1U)          /*!< Bit field size in bits for UART_D_R4T4. */

/*! @brief Read current value of the UART_D_R4T4 field. */
#define BR_UART_D_R4T4(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R4T4, BS_UART_D_R4T4))

/*! @brief Format value for bitfield UART_D_R4T4. */
#define BF_UART_D_R4T4(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R4T4) & BM_UART_D_R4T4)

/*! @brief Set the R4T4 field to a new value. */
#define BW_UART_D_R4T4(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R4T4), BP_UART_D_R4T4, 1))
/*@}*/

/*!
 * @name Register UART_D, field R5T5[5] (RW)
 *
 * Read receive data buffer 5 or write transmit data buffer 5.
 */
/*@{*/
#define BP_UART_D_R5T5       (5U)          /*!< Bit position for UART_D_R5T5. */
#define BM_UART_D_R5T5       (0x20U)       /*!< Bit mask for UART_D_R5T5. */
#define BS_UART_D_R5T5       (1U)          /*!< Bit field size in bits for UART_D_R5T5. */

/*! @brief Read current value of the UART_D_R5T5 field. */
#define BR_UART_D_R5T5(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R5T5, BS_UART_D_R5T5))

/*! @brief Format value for bitfield UART_D_R5T5. */
#define BF_UART_D_R5T5(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R5T5) & BM_UART_D_R5T5)

