flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*! @brief Set the R5T5 field to a new value. */
#define BW_UART_D_R5T5(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R5T5), BP_UART_D_R5T5, 1))
/*@}*/

/*!
 * @name Register UART_D, field R6T6[6] (RW)
 *
 * Read receive data buffer 6 or write transmit data buffer 6.
 */
/*@{*/
#define BP_UART_D_R6T6       (6U)          /*!< Bit position for UART_D_R6T6. */
#define BM_UART_D_R6T6       (0x40U)       /*!< Bit mask for UART_D_R6T6. */
#define BS_UART_D_R6T6       (1U)          /*!< Bit field size in bits for UART_D_R6T6. */

/*! @brief Read current value of the UART_D_R6T6 field. */
#define BR_UART_D_R6T6(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R6T6, BS_UART_D_R6T6))

/*! @brief Format value for bitfield UART_D_R6T6. */
#define BF_UART_D_R6T6(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R6T6) & BM_UART_D_R6T6)

/*! @brief Set the R6T6 field to a new value. */
#define BW_UART_D_R6T6(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R6T6), BP_UART_D_R6T6, 1))
/*@}*/

/*!
 * @name Register UART_D, field R7T7[7] (RW)
 *
 * Read receive data buffer 7 or write transmit data buffer 7.
 */
/*@{*/
#define BP_UART_D_R7T7       (7U)          /*!< Bit position for UART_D_R7T7. */
#define BM_UART_D_R7T7       (0x80U)       /*!< Bit mask for UART_D_R7T7. */
#define BS_UART_D_R7T7       (1U)          /*!< Bit field size in bits for UART_D_R7T7. */

/*! @brief Read current value of the UART_D_R7T7 field. */
#define BR_UART_D_R7T7(x)    (BME_UBFX8(HW_UART_D_ADDR(x), BP_UART_D_R7T7, BS_UART_D_R7T7))

/*! @brief Format value for bitfield UART_D_R7T7. */
#define BF_UART_D_R7T7(v)    ((uint8_t)((uint8_t)(v) << BP_UART_D_R7T7) & BM_UART_D_R7T7)

/*! @brief Set the R7T7 field to a new value. */
#define BW_UART_D_R7T7(x, v) (BME_BFI8(HW_UART_D_ADDR(x), ((uint8_t)(v) << BP_UART_D_R7T7), BP_UART_D_R7T7, 1))
/*@}*/

/*******************************************************************************
 * HW_UART_C4 - UART Control Register 4
 ******************************************************************************/

/*!
 * @brief HW_UART_C4 - UART Control Register 4 (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_c4
{
    uint8_t U;
    struct _hw_uart_c4_bitfields
    {
        uint8_t RESERVED0 : 5;         /*!< [4:0]  */
        uint8_t RDMAS : 1;             /*!< [5] Receiver Full DMA Select */
        uint8_t RESERVED1 : 1;         /*!< [6]  */
        uint8_t TDMAS : 1;             /*!< [7] Transmitter DMA Select */
    } B;
} hw_uart_c4_t;

/*!
 * @name Constants and macros for entire UART_C4 register
 */
/*@{*/
#define HW_UART_C4_ADDR(x)       ((uint32_t)(x) + 0x8U)

#define HW_UART_C4(x)            (*(__IO hw_uart_c4_t *) HW_UART_C4_ADDR(x))
#define HW_UART_C4_RD(x)         (HW_UART_C4(x).U)
#define HW_UART_C4_WR(x, v)      (HW_UART_C4(x).U = (v))
#define HW_UART_C4_SET(x, v)     (BME_OR8(HW_UART_C4_ADDR(x), (uint8_t)(v)))
#define HW_UART_C4_CLR(x, v)     (BME_AND8(HW_UART_C4_ADDR(x), (uint8_t)(~(v))))
#define HW_UART_C4_TOG(x, v)     (BME_XOR8(HW_UART_C4_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART_C4 bitfields
 */

/*!
 * @name Register UART_C4, field RDMAS[5] (RW)
 *
 * RDMAS configures the receiver data register full flag, RDRF, to generate
 * interrupt or DMA requests if RIE is set. If RIE is cleared, the RDRF DMA and RDRF
 * interrupt request signals are not asserted when the RDRF flag is set,
 * regardless of the state of RDMAS.
 *
 * Values:
 * - 0 - If RIE is set and the RDRF flag is set, the RDRF interrupt request
 *     signal is asserted to request interrupt service.
 * - 1 - If RIE is set and the RDRF flag is set, the RDRF DMA request signal is
 *     asserted to request a DMA transfer.
 */
/*@{*/
#define BP_UART_C4_RDMAS     (5U)          /*!< Bit position for UART_C4_RDMAS. */
#define BM_UART_C4_RDMAS     (0x20U)       /*!< Bit mask for UART_C4_RDMAS. */
#define BS_UART_C4_RDMAS     (1U)          /*!< Bit field size in bits for UART_C4_RDMAS. */

/*! @brief Read current value of the UART_C4_RDMAS field. */
#define BR_UART_C4_RDMAS(x)  (BME_UBFX8(HW_UART_C4_ADDR(x), BP_UART_C4_RDMAS, BS_UART_C4_RDMAS))

/*! @brief Format value for bitfield UART_C4_RDMAS. */
#define BF_UART_C4_RDMAS(v)  ((uint8_t)((uint8_t)(v) << BP_UART_C4_RDMAS) & BM_UART_C4_RDMAS)

/*! @brief Set the RDMAS field to a new value. */
#define BW_UART_C4_RDMAS(x, v) (BME_BFI8(HW_UART_C4_ADDR(x), ((uint8_t)(v) << BP_UART_C4_RDMAS), BP_UART_C4_RDMAS, 1))
/*@}*/

/*!
 * @name Register UART_C4, field TDMAS[7] (RW)
 *
 * TDMAS configures the transmit data register empty flag, TDRE, to generate
 * interrupt or DMA requests if TIE is set. If UART_C2[TIE] is cleared, TDRE DMA and
 * TDRE interrupt request signals are not asserted when the TDRE flag is set,
 * regardless of the state of TDMAS. If UART_C2[TIE] and TDMAS are both set, then
 * UART_C2[TCIE] must be cleared, and UART_D must not be written outside of
 * servicing of a DMA request.
 *
 * Values:
 * - 0 - If TIE is set and the TDRE flag is set, the TDRE interrupt request
 *     signal is asserted to request interrupt service.
 * - 1 - If TIE is set and the TDRE flag is set, the TDRE DMA request signal is
 *     asserted to request a DMA transfer.
 */
/*@{*/
#define BP_UART_C4_TDMAS     (7U)          /*!< Bit position for UART_C4_TDMAS. */
#define BM_UART_C4_TDMAS     (0x80U)       /*!< Bit mask for UART_C4_TDMAS. */
#define BS_UART_C4_TDMAS     (1U)          /*!< Bit field size in bits for UART_C4_TDMAS. */

/*! @brief Read current value of the UART_C4_TDMAS field. */
#define BR_UART_C4_TDMAS(x)  (BME_UBFX8(HW_UART_C4_ADDR(x), BP_UART_C4_TDMAS, BS_UART_C4_TDMAS))

/*! @brief Format value for bitfield UART_C4_TDMAS. */
#define BF_UART_C4_TDMAS(v)  ((uint8_t)((uint8_t)(v) << BP_UART_C4_TDMAS) & BM_UART_C4_TDMAS)

/*! @brief Set the TDMAS field to a new value. */
#define BW_UART_C4_TDMAS(x, v) (BME_BFI8(HW_UART_C4_ADDR(x), ((uint8_t)(v) << BP_UART_C4_TDMAS), BP_UART_C4_TDMAS, 1))
/*@}*/

/*******************************************************************************
 * hw_uart_t - module struct
 ******************************************************************************/
/*!
 * @brief All UART module registers.
 */
#pragma pack(1)
typedef struct _hw_uart
{
    __IO hw_uart_bdh_t BDH;                /*!< [0x0] UART Baud Rate Register: High */
    __IO hw_uart_bdl_t BDL;                /*!< [0x1] UART Baud Rate Register: Low */
    __IO hw_uart_c1_t C1;                  /*!< [0x2] UART Control Register 1 */
    __IO hw_uart_c2_t C2;                  /*!< [0x3] UART Control Register 2 */
    __I hw_uart_s1_t S1;                   /*!< [0x4] UART Status Register 1 */
    __IO hw_uart_s2_t S2;                  /*!< [0x5] UART Status Register 2 */
    __IO hw_uart_c3_t C3;                  /*!< [0x6] UART Control Register 3 */
    __IO hw_uart_d_t D;                    /*!< [0x7] UART Data Register */
    __IO hw_uart_c4_t C4;                  /*!< [0x8] UART Control Register 4 */
} hw_uart_t;
#pragma pack()

/*! @brief Macro to access all UART registers. */
/*! @param x UART module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_UART_REGS(UART1_BASE)</code>. */
#define HW_UART_REGS(x) (*(hw_uart_t *)(x))

