flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*! @brief Set the LBKDIE field to a new value. */
#define BW_UART0_BDH_LBKDIE(x, v) (BME_BFI8(HW_UART0_BDH_ADDR(x), ((uint8_t)(v) << BP_UART0_BDH_LBKDIE), BP_UART0_BDH_LBKDIE, 1))
/*@}*/

/*******************************************************************************
 * HW_UART0_BDL - UART Baud Rate Register Low
 ******************************************************************************/

/*!
 * @brief HW_UART0_BDL - UART Baud Rate Register Low (RW)
 *
 * Reset value: 0x04U
 *
 * This register, along with UART _BDH, control the prescale divisor for UART
 * baud rate generation. The 13-bit baud rate setting [SBR12:SBR0] can only be
 * updated when the transmitter and receiver are both disabled. UART _BDL is reset to
 * a non-zero value, so after reset the baud rate generator remains disabled
 * until the first time the receiver or transmitter is enabled; that is, UART
 * _C2[RE] or UART _C2[TE] bits are written to 1.
 */
typedef union _hw_uart0_bdl
{
    uint8_t U;
    struct _hw_uart0_bdl_bitfields
    {
        uint8_t SBR : 8;               /*!< [7:0] Baud Rate Modulo Divisor */
    } B;
} hw_uart0_bdl_t;

/*!
 * @name Constants and macros for entire UART0_BDL register
 */
/*@{*/
#define HW_UART0_BDL_ADDR(x)     ((uint32_t)(x) + 0x1U)

#define HW_UART0_BDL(x)          (*(__IO hw_uart0_bdl_t *) HW_UART0_BDL_ADDR(x))
#define HW_UART0_BDL_RD(x)       (HW_UART0_BDL(x).U)
#define HW_UART0_BDL_WR(x, v)    (HW_UART0_BDL(x).U = (v))
#define HW_UART0_BDL_SET(x, v)   (BME_OR8(HW_UART0_BDL_ADDR(x), (uint8_t)(v)))
#define HW_UART0_BDL_CLR(x, v)   (BME_AND8(HW_UART0_BDL_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_BDL_TOG(x, v)   (BME_XOR8(HW_UART0_BDL_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_BDL bitfields
 */

/*!
 * @name Register UART0_BDL, field SBR[7:0] (RW)
 *
 * These 13 bits in SBR[12:0] are referred to collectively as BR. They set the
 * modulo divide rate for the baud rate generator. When BR is 1 - 8191, the baud
 * rate equals baud clock/((OSR+1) * BR).
 */
/*@{*/
#define BP_UART0_BDL_SBR     (0U)          /*!< Bit position for UART0_BDL_SBR. */
#define BM_UART0_BDL_SBR     (0xFFU)       /*!< Bit mask for UART0_BDL_SBR. */
#define BS_UART0_BDL_SBR     (8U)          /*!< Bit field size in bits for UART0_BDL_SBR. */

/*! @brief Read current value of the UART0_BDL_SBR field. */
#define BR_UART0_BDL_SBR(x)  (HW_UART0_BDL(x).U)

/*! @brief Format value for bitfield UART0_BDL_SBR. */
#define BF_UART0_BDL_SBR(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_BDL_SBR) & BM_UART0_BDL_SBR)

/*! @brief Set the SBR field to a new value. */
#define BW_UART0_BDL_SBR(x, v) (HW_UART0_BDL_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART0_C1 - UART Control Register 1
 ******************************************************************************/

/*!
 * @brief HW_UART0_C1 - UART Control Register 1 (RW)
 *
 * Reset value: 0x00U
 *
 * This read/write register controls various optional features of the UART
 * system. This register should only be altered when the transmitter and receiver are
 * both disabled.
 */
typedef union _hw_uart0_c1
{
    uint8_t U;
    struct _hw_uart0_c1_bitfields
    {
        uint8_t PT : 1;                /*!< [0] Parity Type */
        uint8_t PE : 1;                /*!< [1] Parity Enable */
        uint8_t ILT : 1;               /*!< [2] Idle Line Type Select */
        uint8_t WAKE : 1;              /*!< [3] Receiver Wakeup Method Select */
        uint8_t M : 1;                 /*!< [4] 9-Bit or 8-Bit Mode Select */
        uint8_t RSRC : 1;              /*!< [5] Receiver Source Select */
        uint8_t DOZEEN : 1;            /*!< [6] Doze Enable */
        uint8_t LOOPS : 1;             /*!< [7] Loop Mode Select */
    } B;
} hw_uart0_c1_t;

/*!
 * @name Constants and macros for entire UART0_C1 register
 */
/*@{*/
#define HW_UART0_C1_ADDR(x)      ((uint32_t)(x) + 0x2U)

#define HW_UART0_C1(x)           (*(__IO hw_uart0_c1_t *) HW_UART0_C1_ADDR(x))
#define HW_UART0_C1_RD(x)        (HW_UART0_C1(x).U)
#define HW_UART0_C1_WR(x, v)     (HW_UART0_C1(x).U = (v))
#define HW_UART0_C1_SET(x, v)    (BME_OR8(HW_UART0_C1_ADDR(x), (uint8_t)(v)))
#define HW_UART0_C1_CLR(x, v)    (BME_AND8(HW_UART0_C1_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_C1_TOG(x, v)    (BME_XOR8(HW_UART0_C1_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_C1 bitfields
 */

/*!
 * @name Register UART0_C1, field PT[0] (RW)
 *
 * Provided parity is enabled (PE = 1), this bit selects even or odd parity. Odd
 * parity means the total number of 1s in the data character, including the
 * parity bit, is odd. Even parity means the total number of 1s in the data
 * character, including the parity bit, is even.
 *
 * Values:
 * - 0 - Even parity.
 * - 1 - Odd parity.
 */
/*@{*/
#define BP_UART0_C1_PT       (0U)          /*!< Bit position for UART0_C1_PT. */
#define BM_UART0_C1_PT       (0x01U)       /*!< Bit mask for UART0_C1_PT. */
#define BS_UART0_C1_PT       (1U)          /*!< Bit field size in bits for UART0_C1_PT. */

/*! @brief Read current value of the UART0_C1_PT field. */
#define BR_UART0_C1_PT(x)    (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_PT, BS_UART0_C1_PT))

/*! @brief Format value for bitfield UART0_C1_PT. */
#define BF_UART0_C1_PT(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_C1_PT) & BM_UART0_C1_PT)

/*! @brief Set the PT field to a new value. */
#define BW_UART0_C1_PT(x, v) (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_PT), BP_UART0_C1_PT, 1))
/*@}*/

/*!
 * @name Register UART0_C1, field PE[1] (RW)
 *
 * Enables hardware parity generation and checking. When parity is enabled, the
 * bit immediately before the stop bit is treated as the parity bit.
 *
 * Values:
 * - 0 - No hardware parity generation or checking.
 * - 1 - Parity enabled.
 */
/*@{*/
#define BP_UART0_C1_PE       (1U)          /*!< Bit position for UART0_C1_PE. */
#define BM_UART0_C1_PE       (0x02U)       /*!< Bit mask for UART0_C1_PE. */
#define BS_UART0_C1_PE       (1U)          /*!< Bit field size in bits for UART0_C1_PE. */

