flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*! @brief Read current value of the UART0_C1_PE field. */
#define BR_UART0_C1_PE(x)    (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_PE, BS_UART0_C1_PE))

/*! @brief Format value for bitfield UART0_C1_PE. */
#define BF_UART0_C1_PE(v)    ((uint8_t)((uint8_t)(v) << BP_UART0_C1_PE) & BM_UART0_C1_PE)

/*! @brief Set the PE field to a new value. */
#define BW_UART0_C1_PE(x, v) (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_PE), BP_UART0_C1_PE, 1))
/*@}*/

/*!
 * @name Register UART0_C1, field ILT[2] (RW)
 *
 * Setting this bit to 1 ensures that the stop bits and logic 1 bits at the end
 * of a character do not count toward the 10 to 13 bit times of logic high level
 * needed by the idle line detection logic.
 *
 * Values:
 * - 0 - Idle character bit count starts after start bit.
 * - 1 - Idle character bit count starts after stop bit.
 */
/*@{*/
#define BP_UART0_C1_ILT      (2U)          /*!< Bit position for UART0_C1_ILT. */
#define BM_UART0_C1_ILT      (0x04U)       /*!< Bit mask for UART0_C1_ILT. */
#define BS_UART0_C1_ILT      (1U)          /*!< Bit field size in bits for UART0_C1_ILT. */

/*! @brief Read current value of the UART0_C1_ILT field. */
#define BR_UART0_C1_ILT(x)   (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_ILT, BS_UART0_C1_ILT))

/*! @brief Format value for bitfield UART0_C1_ILT. */
#define BF_UART0_C1_ILT(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C1_ILT) & BM_UART0_C1_ILT)

/*! @brief Set the ILT field to a new value. */
#define BW_UART0_C1_ILT(x, v) (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_ILT), BP_UART0_C1_ILT, 1))
/*@}*/

/*!
 * @name Register UART0_C1, field WAKE[3] (RW)
 *
 * Values:
 * - 0 - Idle-line wakeup.
 * - 1 - Address-mark wakeup.
 */
/*@{*/
#define BP_UART0_C1_WAKE     (3U)          /*!< Bit position for UART0_C1_WAKE. */
#define BM_UART0_C1_WAKE     (0x08U)       /*!< Bit mask for UART0_C1_WAKE. */
#define BS_UART0_C1_WAKE     (1U)          /*!< Bit field size in bits for UART0_C1_WAKE. */

/*! @brief Read current value of the UART0_C1_WAKE field. */
#define BR_UART0_C1_WAKE(x)  (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_WAKE, BS_UART0_C1_WAKE))

/*! @brief Format value for bitfield UART0_C1_WAKE. */
#define BF_UART0_C1_WAKE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C1_WAKE) & BM_UART0_C1_WAKE)

/*! @brief Set the WAKE field to a new value. */
#define BW_UART0_C1_WAKE(x, v) (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_WAKE), BP_UART0_C1_WAKE, 1))
/*@}*/

/*!
 * @name Register UART0_C1, field M[4] (RW)
 *
 * Values:
 * - 0 - Receiver and transmitter use 8-bit data characters.
 * - 1 - Receiver and transmitter use 9-bit data characters.
 */
/*@{*/
#define BP_UART0_C1_M        (4U)          /*!< Bit position for UART0_C1_M. */
#define BM_UART0_C1_M        (0x10U)       /*!< Bit mask for UART0_C1_M. */
#define BS_UART0_C1_M        (1U)          /*!< Bit field size in bits for UART0_C1_M. */

/*! @brief Read current value of the UART0_C1_M field. */
#define BR_UART0_C1_M(x)     (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_M, BS_UART0_C1_M))

/*! @brief Format value for bitfield UART0_C1_M. */
#define BF_UART0_C1_M(v)     ((uint8_t)((uint8_t)(v) << BP_UART0_C1_M) & BM_UART0_C1_M)

/*! @brief Set the M field to a new value. */
#define BW_UART0_C1_M(x, v)  (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_M), BP_UART0_C1_M, 1))
/*@}*/

/*!
 * @name Register UART0_C1, field RSRC[5] (RW)
 *
 * This bit has no meaning or effect unless the LOOPS bit is set to 1. When
 * LOOPS is set, the receiver input is internally connected to the UART _TX pin and
 * RSRC determines whether this connection is also connected to the transmitter
 * output.
 *
 * Values:
 * - 0 - Provided LOOPS is set, RSRC is cleared, selects internal loop back mode
 *     and the UART does not use the UART _RX pins.
 * - 1 - Single-wire UART mode where the UART _TX pin is connected to the
 *     transmitter output and receiver input.
 */
/*@{*/
#define BP_UART0_C1_RSRC     (5U)          /*!< Bit position for UART0_C1_RSRC. */
#define BM_UART0_C1_RSRC     (0x20U)       /*!< Bit mask for UART0_C1_RSRC. */
#define BS_UART0_C1_RSRC     (1U)          /*!< Bit field size in bits for UART0_C1_RSRC. */

/*! @brief Read current value of the UART0_C1_RSRC field. */
#define BR_UART0_C1_RSRC(x)  (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_RSRC, BS_UART0_C1_RSRC))

/*! @brief Format value for bitfield UART0_C1_RSRC. */
#define BF_UART0_C1_RSRC(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C1_RSRC) & BM_UART0_C1_RSRC)

/*! @brief Set the RSRC field to a new value. */
#define BW_UART0_C1_RSRC(x, v) (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_RSRC), BP_UART0_C1_RSRC, 1))
/*@}*/

/*!
 * @name Register UART0_C1, field DOZEEN[6] (RW)
 *
 * Values:
 * - 0 - UART is enabled in Wait mode.
 * - 1 - UART is disabled in Wait mode.
 */
/*@{*/
#define BP_UART0_C1_DOZEEN   (6U)          /*!< Bit position for UART0_C1_DOZEEN. */
#define BM_UART0_C1_DOZEEN   (0x40U)       /*!< Bit mask for UART0_C1_DOZEEN. */
#define BS_UART0_C1_DOZEEN   (1U)          /*!< Bit field size in bits for UART0_C1_DOZEEN. */

/*! @brief Read current value of the UART0_C1_DOZEEN field. */
#define BR_UART0_C1_DOZEEN(x) (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_DOZEEN, BS_UART0_C1_DOZEEN))

/*! @brief Format value for bitfield UART0_C1_DOZEEN. */
#define BF_UART0_C1_DOZEEN(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C1_DOZEEN) & BM_UART0_C1_DOZEEN)

/*! @brief Set the DOZEEN field to a new value. */
#define BW_UART0_C1_DOZEEN(x, v) (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_DOZEEN), BP_UART0_C1_DOZEEN, 1))
/*@}*/

/*!
 * @name Register UART0_C1, field LOOPS[7] (RW)
 *
 * Selects between loop back modes and normal 2-pin full-duplex modes. When
 * LOOPS is set, the transmitter output is internally connected to the receiver input.
 *
 * Values:
 * - 0 - Normal operation - UART _RX and UART _TX use separate pins.
 * - 1 - Loop mode or single-wire mode where transmitter outputs are internally
 *     connected to receiver input. (See RSRC bit.) UART _RX pin is not used by
 *     UART .
 */
/*@{*/
#define BP_UART0_C1_LOOPS    (7U)          /*!< Bit position for UART0_C1_LOOPS. */
#define BM_UART0_C1_LOOPS    (0x80U)       /*!< Bit mask for UART0_C1_LOOPS. */
#define BS_UART0_C1_LOOPS    (1U)          /*!< Bit field size in bits for UART0_C1_LOOPS. */

/*! @brief Read current value of the UART0_C1_LOOPS field. */
#define BR_UART0_C1_LOOPS(x) (BME_UBFX8(HW_UART0_C1_ADDR(x), BP_UART0_C1_LOOPS, BS_UART0_C1_LOOPS))

/*! @brief Format value for bitfield UART0_C1_LOOPS. */
#define BF_UART0_C1_LOOPS(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C1_LOOPS) & BM_UART0_C1_LOOPS)

/*! @brief Set the LOOPS field to a new value. */
#define BW_UART0_C1_LOOPS(x, v) (BME_BFI8(HW_UART0_C1_ADDR(x), ((uint8_t)(v) << BP_UART0_C1_LOOPS), BP_UART0_C1_LOOPS, 1))
/*@}*/

