flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*******************************************************************************
 * HW_UART0_S2 - UART Status Register 2
 ******************************************************************************/

/*!
 * @brief HW_UART0_S2 - UART Status Register 2 (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains one read-only status flag. When using an internal
 * oscillator in a LIN system, it is necessary to raise the break detection threshold
 * one bit time. Under the worst case timing conditions allowed in LIN, it is
 * possible that a 0x00 data character can appear to be 10.26 bit times long at a
 * slave running 14% faster than the master. This would trigger normal break
 * detection circuitry designed to detect a 10-bit break symbol. When the LBKDE bit is
 * set, framing errors are inhibited and the break detection threshold
 * increases, preventing false detection of a 0x00 data character as a LIN break symbol.
 */
typedef union _hw_uart0_s2
{
    uint8_t U;
    struct _hw_uart0_s2_bitfields
    {
        uint8_t RAF : 1;               /*!< [0] Receiver Active Flag */
        uint8_t LBKDE : 1;             /*!< [1] LIN Break Detection Enable */
        uint8_t BRK13 : 1;             /*!< [2] Break Character Generation Length */
        uint8_t RWUID : 1;             /*!< [3] Receive Wake Up Idle Detect */
        uint8_t RXINV : 1;             /*!< [4] Receive Data Inversion */
        uint8_t MSBF : 1;              /*!< [5] MSB First */
        uint8_t RXEDGIF : 1;           /*!< [6] UART _RX Pin Active Edge Interrupt Flag
                                        * */
        uint8_t LBKDIF : 1;            /*!< [7] LIN Break Detect Interrupt Flag */
    } B;
} hw_uart0_s2_t;

/*!
 * @name Constants and macros for entire UART0_S2 register
 */
/*@{*/
#define HW_UART0_S2_ADDR(x)      ((uint32_t)(x) + 0x5U)

#define HW_UART0_S2(x)           (*(__IO hw_uart0_s2_t *) HW_UART0_S2_ADDR(x))
#define HW_UART0_S2_RD(x)        (HW_UART0_S2(x).U)
#define HW_UART0_S2_WR(x, v)     (HW_UART0_S2(x).U = (v))
#define HW_UART0_S2_SET(x, v)    (BME_OR8(HW_UART0_S2_ADDR(x), (uint8_t)(v)))
#define HW_UART0_S2_CLR(x, v)    (BME_AND8(HW_UART0_S2_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_S2_TOG(x, v)    (BME_XOR8(HW_UART0_S2_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_S2 bitfields
 */

/*!
 * @name Register UART0_S2, field RAF[0] (RO)
 *
 * RAF is set when the UART receiver detects the beginning of a valid start bit,
 * and RAF is cleared automatically when the receiver detects an idle line.
 *
 * Values:
 * - 0 - UART receiver idle waiting for a start bit.
 * - 1 - UART receiver active ( UART _RXD input not idle).
 */
/*@{*/
#define BP_UART0_S2_RAF      (0U)          /*!< Bit position for UART0_S2_RAF. */
#define BM_UART0_S2_RAF      (0x01U)       /*!< Bit mask for UART0_S2_RAF. */
#define BS_UART0_S2_RAF      (1U)          /*!< Bit field size in bits for UART0_S2_RAF. */

/*! @brief Read current value of the UART0_S2_RAF field. */
#define BR_UART0_S2_RAF(x)   (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_RAF, BS_UART0_S2_RAF))
/*@}*/

/*!
 * @name Register UART0_S2, field LBKDE[1] (RW)
 *
 * LBKDE selects a longer break character detection length. While LBKDE is set,
 * framing error (FE) and receive data register full (RDRF) flags are prevented
 * from setting.
 *
 * Values:
 * - 0 - Break character is detected at length 10 bit times (if M = 0, SBNS = 0)
 *     or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1, SBNS = 1
 *     or M10 = 1, SNBS = 0) or 13 (if M10 = 1, SNBS = 1).
 * - 1 - Break character is detected at length of 11 bit times (if M = 0, SBNS =
 *     0) or 12 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 14 (if M = 1, SBNS =
 *     1 or M10 = 1, SNBS = 0) or 15 (if M10 = 1, SNBS = 1).
 */
/*@{*/
#define BP_UART0_S2_LBKDE    (1U)          /*!< Bit position for UART0_S2_LBKDE. */
#define BM_UART0_S2_LBKDE    (0x02U)       /*!< Bit mask for UART0_S2_LBKDE. */
#define BS_UART0_S2_LBKDE    (1U)          /*!< Bit field size in bits for UART0_S2_LBKDE. */

/*! @brief Read current value of the UART0_S2_LBKDE field. */
#define BR_UART0_S2_LBKDE(x) (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_LBKDE, BS_UART0_S2_LBKDE))

/*! @brief Format value for bitfield UART0_S2_LBKDE. */
#define BF_UART0_S2_LBKDE(v) ((uint8_t)((uint8_t)(v) << BP_UART0_S2_LBKDE) & BM_UART0_S2_LBKDE)

/*! @brief Set the LBKDE field to a new value. */
#define BW_UART0_S2_LBKDE(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_LBKDE), BP_UART0_S2_LBKDE, 1))
/*@}*/

/*!
 * @name Register UART0_S2, field BRK13[2] (RW)
 *
 * BRK13 selects a longer transmitted break character length. Detection of a
 * framing error is not affected by the state of this bit. This bit should only be
 * changed when the transmitter is disabled.
 *
 * Values:
 * - 0 - Break character is transmitted with length of 10 bit times (if M = 0,
 *     SBNS = 0) or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1,
 *     SBNS = 1 or M10 = 1, SNBS = 0) or 13 (if M10 = 1, SNBS = 1).
 * - 1 - Break character is transmitted with length of 13 bit times (if M = 0,
 *     SBNS = 0) or 14 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 15 (if M = 1,
 *     SBNS = 1 or M10 = 1, SNBS = 0) or 16 (if M10 = 1, SNBS = 1).
 */
/*@{*/
#define BP_UART0_S2_BRK13    (2U)          /*!< Bit position for UART0_S2_BRK13. */
#define BM_UART0_S2_BRK13    (0x04U)       /*!< Bit mask for UART0_S2_BRK13. */
#define BS_UART0_S2_BRK13    (1U)          /*!< Bit field size in bits for UART0_S2_BRK13. */

/*! @brief Read current value of the UART0_S2_BRK13 field. */
#define BR_UART0_S2_BRK13(x) (BME_UBFX8(HW_UART0_S2_ADDR(x), BP_UART0_S2_BRK13, BS_UART0_S2_BRK13))

/*! @brief Format value for bitfield UART0_S2_BRK13. */
#define BF_UART0_S2_BRK13(v) ((uint8_t)((uint8_t)(v) << BP_UART0_S2_BRK13) & BM_UART0_S2_BRK13)

/*! @brief Set the BRK13 field to a new value. */
#define BW_UART0_S2_BRK13(x, v) (BME_BFI8(HW_UART0_S2_ADDR(x), ((uint8_t)(v) << BP_UART0_S2_BRK13), BP_UART0_S2_BRK13, 1))
/*@}*/

/*!
 * @name Register UART0_S2, field RWUID[3] (RW)
 *
 * RWUID controls whether the idle character that wakes up the receiver sets the
 * IDLE bit. This bit should only be changed when the receiver is disabled.
 *
 * Values:
 * - 0 - During receive standby state (RWU = 1), the IDLE bit does not get set
 *     upon detection of an idle character.
 * - 1 - During receive standby state (RWU = 1), the IDLE bit gets set upon
 *     detection of an idle character.
 */
/*@{*/
#define BP_UART0_S2_RWUID    (3U)          /*!< Bit position for UART0_S2_RWUID. */
#define BM_UART0_S2_RWUID    (0x08U)       /*!< Bit mask for UART0_S2_RWUID. */
#define BS_UART0_S2_RWUID    (1U)          /*!< Bit field size in bits for UART0_S2_RWUID. */

