flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*
 * Constants & macros for individual UART0_C3 bitfields
 */

/*!
 * @name Register UART0_C3, field PEIE[0] (RW)
 *
 * This bit enables the parity error flag (PF) to generate hardware interrupt
 * requests.
 *
 * Values:
 * - 0 - PF interrupts disabled; use polling).
 * - 1 - Hardware interrupt requested when PF is set.
 */
/*@{*/
#define BP_UART0_C3_PEIE     (0U)          /*!< Bit position for UART0_C3_PEIE. */
#define BM_UART0_C3_PEIE     (0x01U)       /*!< Bit mask for UART0_C3_PEIE. */
#define BS_UART0_C3_PEIE     (1U)          /*!< Bit field size in bits for UART0_C3_PEIE. */

/*! @brief Read current value of the UART0_C3_PEIE field. */
#define BR_UART0_C3_PEIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_PEIE, BS_UART0_C3_PEIE))

/*! @brief Format value for bitfield UART0_C3_PEIE. */
#define BF_UART0_C3_PEIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_PEIE) & BM_UART0_C3_PEIE)

/*! @brief Set the PEIE field to a new value. */
#define BW_UART0_C3_PEIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_PEIE), BP_UART0_C3_PEIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field FEIE[1] (RW)
 *
 * This bit enables the framing error flag (FE) to generate hardware interrupt
 * requests.
 *
 * Values:
 * - 0 - FE interrupts disabled; use polling.
 * - 1 - Hardware interrupt requested when FE is set.
 */
/*@{*/
#define BP_UART0_C3_FEIE     (1U)          /*!< Bit position for UART0_C3_FEIE. */
#define BM_UART0_C3_FEIE     (0x02U)       /*!< Bit mask for UART0_C3_FEIE. */
#define BS_UART0_C3_FEIE     (1U)          /*!< Bit field size in bits for UART0_C3_FEIE. */

/*! @brief Read current value of the UART0_C3_FEIE field. */
#define BR_UART0_C3_FEIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_FEIE, BS_UART0_C3_FEIE))

/*! @brief Format value for bitfield UART0_C3_FEIE. */
#define BF_UART0_C3_FEIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_FEIE) & BM_UART0_C3_FEIE)

/*! @brief Set the FEIE field to a new value. */
#define BW_UART0_C3_FEIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_FEIE), BP_UART0_C3_FEIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field NEIE[2] (RW)
 *
 * This bit enables the noise flag (NF) to generate hardware interrupt requests.
 *
 * Values:
 * - 0 - NF interrupts disabled; use polling.
 * - 1 - Hardware interrupt requested when NF is set.
 */
/*@{*/
#define BP_UART0_C3_NEIE     (2U)          /*!< Bit position for UART0_C3_NEIE. */
#define BM_UART0_C3_NEIE     (0x04U)       /*!< Bit mask for UART0_C3_NEIE. */
#define BS_UART0_C3_NEIE     (1U)          /*!< Bit field size in bits for UART0_C3_NEIE. */

/*! @brief Read current value of the UART0_C3_NEIE field. */
#define BR_UART0_C3_NEIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_NEIE, BS_UART0_C3_NEIE))

/*! @brief Format value for bitfield UART0_C3_NEIE. */
#define BF_UART0_C3_NEIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_NEIE) & BM_UART0_C3_NEIE)

/*! @brief Set the NEIE field to a new value. */
#define BW_UART0_C3_NEIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_NEIE), BP_UART0_C3_NEIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field ORIE[3] (RW)
 *
 * This bit enables the overrun flag (OR) to generate hardware interrupt
 * requests.
 *
 * Values:
 * - 0 - OR interrupts disabled; use polling.
 * - 1 - Hardware interrupt requested when OR is set.
 */
/*@{*/
#define BP_UART0_C3_ORIE     (3U)          /*!< Bit position for UART0_C3_ORIE. */
#define BM_UART0_C3_ORIE     (0x08U)       /*!< Bit mask for UART0_C3_ORIE. */
#define BS_UART0_C3_ORIE     (1U)          /*!< Bit field size in bits for UART0_C3_ORIE. */

/*! @brief Read current value of the UART0_C3_ORIE field. */
#define BR_UART0_C3_ORIE(x)  (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_ORIE, BS_UART0_C3_ORIE))

/*! @brief Format value for bitfield UART0_C3_ORIE. */
#define BF_UART0_C3_ORIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART0_C3_ORIE) & BM_UART0_C3_ORIE)

/*! @brief Set the ORIE field to a new value. */
#define BW_UART0_C3_ORIE(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_ORIE), BP_UART0_C3_ORIE, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field TXINV[4] (RW)
 *
 * Setting this bit reverses the polarity of the transmitted data output.
 * Setting TXINV inverts the UART _TXD output for all cases: data bits, start and stop
 * bits, break, and idle.
 *
 * Values:
 * - 0 - Transmit data not inverted.
 * - 1 - Transmit data inverted.
 */
/*@{*/
#define BP_UART0_C3_TXINV    (4U)          /*!< Bit position for UART0_C3_TXINV. */
#define BM_UART0_C3_TXINV    (0x10U)       /*!< Bit mask for UART0_C3_TXINV. */
#define BS_UART0_C3_TXINV    (1U)          /*!< Bit field size in bits for UART0_C3_TXINV. */

/*! @brief Read current value of the UART0_C3_TXINV field. */
#define BR_UART0_C3_TXINV(x) (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_TXINV, BS_UART0_C3_TXINV))

/*! @brief Format value for bitfield UART0_C3_TXINV. */
#define BF_UART0_C3_TXINV(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C3_TXINV) & BM_UART0_C3_TXINV)

/*! @brief Set the TXINV field to a new value. */
#define BW_UART0_C3_TXINV(x, v) (BME_BFI8(HW_UART0_C3_ADDR(x), ((uint8_t)(v) << BP_UART0_C3_TXINV), BP_UART0_C3_TXINV, 1))
/*@}*/

/*!
 * @name Register UART0_C3, field TXDIR[5] (RW)
 *
 * When the is configured for single-wire half-duplex operation (LOOPS = RSRC =
 * 1), this bit determines the direction of data at the UART_TXD pin. When
 * clearing TXDIR, the transmitter will finish receiving the current character (if any)
 * before the receiver starts receiving data from the UART_TXD pin.
 *
 * Values:
 * - 0 - UART _TXD pin is an input in single-wire mode.
 * - 1 - UART _TXD pin is an output in single-wire mode.
 */
/*@{*/
#define BP_UART0_C3_TXDIR    (5U)          /*!< Bit position for UART0_C3_TXDIR. */
#define BM_UART0_C3_TXDIR    (0x20U)       /*!< Bit mask for UART0_C3_TXDIR. */
#define BS_UART0_C3_TXDIR    (1U)          /*!< Bit field size in bits for UART0_C3_TXDIR. */

/*! @brief Read current value of the UART0_C3_TXDIR field. */
#define BR_UART0_C3_TXDIR(x) (BME_UBFX8(HW_UART0_C3_ADDR(x), BP_UART0_C3_TXDIR, BS_UART0_C3_TXDIR))

