flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*******************************************************************************
 * HW_UART0_MA1 - UART Match Address Registers 1
 ******************************************************************************/

/*!
 * @brief HW_UART0_MA1 - UART Match Address Registers 1 (RW)
 *
 * Reset value: 0x00U
 *
 * The MA1 and MA2 registers are compared to input data addresses when the most
 * significant bit is set and the associated C4[MAEN] bit is set. If a match
 * occurs, the following data is transferred to the data register. If a match fails,
 * the following data is discarded. Software should only write a MA register when
 * the associated C4[MAEN] bit is clear.
 */
typedef union _hw_uart0_ma1
{
    uint8_t U;
    struct _hw_uart0_ma1_bitfields
    {
        uint8_t MA : 8;                /*!< [7:0] Match Address */
    } B;
} hw_uart0_ma1_t;

/*!
 * @name Constants and macros for entire UART0_MA1 register
 */
/*@{*/
#define HW_UART0_MA1_ADDR(x)     ((uint32_t)(x) + 0x8U)

#define HW_UART0_MA1(x)          (*(__IO hw_uart0_ma1_t *) HW_UART0_MA1_ADDR(x))
#define HW_UART0_MA1_RD(x)       (HW_UART0_MA1(x).U)
#define HW_UART0_MA1_WR(x, v)    (HW_UART0_MA1(x).U = (v))
#define HW_UART0_MA1_SET(x, v)   (BME_OR8(HW_UART0_MA1_ADDR(x), (uint8_t)(v)))
#define HW_UART0_MA1_CLR(x, v)   (BME_AND8(HW_UART0_MA1_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_MA1_TOG(x, v)   (BME_XOR8(HW_UART0_MA1_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_MA1 bitfields
 */

/*!
 * @name Register UART0_MA1, field MA[7:0] (RW)
 */
/*@{*/
#define BP_UART0_MA1_MA      (0U)          /*!< Bit position for UART0_MA1_MA. */
#define BM_UART0_MA1_MA      (0xFFU)       /*!< Bit mask for UART0_MA1_MA. */
#define BS_UART0_MA1_MA      (8U)          /*!< Bit field size in bits for UART0_MA1_MA. */

/*! @brief Read current value of the UART0_MA1_MA field. */
#define BR_UART0_MA1_MA(x)   (HW_UART0_MA1(x).U)

/*! @brief Format value for bitfield UART0_MA1_MA. */
#define BF_UART0_MA1_MA(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_MA1_MA) & BM_UART0_MA1_MA)

/*! @brief Set the MA field to a new value. */
#define BW_UART0_MA1_MA(x, v) (HW_UART0_MA1_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART0_MA2 - UART Match Address Registers 2
 ******************************************************************************/

/*!
 * @brief HW_UART0_MA2 - UART Match Address Registers 2 (RW)
 *
 * Reset value: 0x00U
 *
 * The MA1 and MA2 registers are compared to input data addresses when the most
 * significant bit is set and the associated C4[MAEN] bit is set. If a match
 * occurs, the following data is transferred to the data register. If a match fails,
 * the following data is discarded. Software should only write a MA register when
 * the associated C4[MAEN] bit is clear.
 */
typedef union _hw_uart0_ma2
{
    uint8_t U;
    struct _hw_uart0_ma2_bitfields
    {
        uint8_t MA : 8;                /*!< [7:0] Match Address */
    } B;
} hw_uart0_ma2_t;

/*!
 * @name Constants and macros for entire UART0_MA2 register
 */
/*@{*/
#define HW_UART0_MA2_ADDR(x)     ((uint32_t)(x) + 0x9U)

#define HW_UART0_MA2(x)          (*(__IO hw_uart0_ma2_t *) HW_UART0_MA2_ADDR(x))
#define HW_UART0_MA2_RD(x)       (HW_UART0_MA2(x).U)
#define HW_UART0_MA2_WR(x, v)    (HW_UART0_MA2(x).U = (v))
#define HW_UART0_MA2_SET(x, v)   (BME_OR8(HW_UART0_MA2_ADDR(x), (uint8_t)(v)))
#define HW_UART0_MA2_CLR(x, v)   (BME_AND8(HW_UART0_MA2_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_MA2_TOG(x, v)   (BME_XOR8(HW_UART0_MA2_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_MA2 bitfields
 */

/*!
 * @name Register UART0_MA2, field MA[7:0] (RW)
 */
/*@{*/
#define BP_UART0_MA2_MA      (0U)          /*!< Bit position for UART0_MA2_MA. */
#define BM_UART0_MA2_MA      (0xFFU)       /*!< Bit mask for UART0_MA2_MA. */
#define BS_UART0_MA2_MA      (8U)          /*!< Bit field size in bits for UART0_MA2_MA. */

/*! @brief Read current value of the UART0_MA2_MA field. */
#define BR_UART0_MA2_MA(x)   (HW_UART0_MA2(x).U)

/*! @brief Format value for bitfield UART0_MA2_MA. */
#define BF_UART0_MA2_MA(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_MA2_MA) & BM_UART0_MA2_MA)

/*! @brief Set the MA field to a new value. */
#define BW_UART0_MA2_MA(x, v) (HW_UART0_MA2_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART0_C4 - UART Control Register 4
 ******************************************************************************/

/*!
 * @brief HW_UART0_C4 - UART Control Register 4 (RW)
 *
 * Reset value: 0x0FU
 */
typedef union _hw_uart0_c4
{
    uint8_t U;
    struct _hw_uart0_c4_bitfields
    {
        uint8_t OSR : 5;               /*!< [4:0] Over Sampling Ratio */
        uint8_t M10 : 1;               /*!< [5] 10-bit Mode select */
        uint8_t MAEN2 : 1;             /*!< [6] Match Address Mode Enable 2 */
        uint8_t MAEN1 : 1;             /*!< [7] Match Address Mode Enable 1 */
    } B;
} hw_uart0_c4_t;

/*!
 * @name Constants and macros for entire UART0_C4 register
 */
/*@{*/
#define HW_UART0_C4_ADDR(x)      ((uint32_t)(x) + 0xAU)

#define HW_UART0_C4(x)           (*(__IO hw_uart0_c4_t *) HW_UART0_C4_ADDR(x))
#define HW_UART0_C4_RD(x)        (HW_UART0_C4(x).U)
#define HW_UART0_C4_WR(x, v)     (HW_UART0_C4(x).U = (v))
#define HW_UART0_C4_SET(x, v)    (BME_OR8(HW_UART0_C4_ADDR(x), (uint8_t)(v)))
#define HW_UART0_C4_CLR(x, v)    (BME_AND8(HW_UART0_C4_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_C4_TOG(x, v)    (BME_XOR8(HW_UART0_C4_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_C4 bitfields
 */

/*!
 * @name Register UART0_C4, field OSR[4:0] (RW)
 *
 * This field configures the oversampling ratio for the receiver between 4x
 * (00011) and 32x (11111). Writing an invalid oversampling ratio will default to an
 * oversampling ratio of 16 (01111). This field should only be changed when the
 * transmitter and receiver are both disabled.
 */
/*@{*/
#define BP_UART0_C4_OSR      (0U)          /*!< Bit position for UART0_C4_OSR. */
#define BM_UART0_C4_OSR      (0x1FU)       /*!< Bit mask for UART0_C4_OSR. */
#define BS_UART0_C4_OSR      (5U)          /*!< Bit field size in bits for UART0_C4_OSR. */

/*! @brief Read current value of the UART0_C4_OSR field. */
#define BR_UART0_C4_OSR(x)   (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_OSR, BS_UART0_C4_OSR))

