flit/argon-rtos/src/include/device/MKL25Z4/MKL25Z4_registers.h
/*! @brief Format value for bitfield UART0_C4_OSR. */
#define BF_UART0_C4_OSR(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C4_OSR) & BM_UART0_C4_OSR)

/*! @brief Set the OSR field to a new value. */
#define BW_UART0_C4_OSR(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_OSR), BP_UART0_C4_OSR, 5))
/*@}*/

/*!
 * @name Register UART0_C4, field M10[5] (RW)
 *
 * The M10 bit causes a tenth bit to be part of the serial transmission. This
 * bit should only be changed when the transmitter and receiver are both disabled.
 *
 * Values:
 * - 0 - Receiver and transmitter use 8-bit or 9-bit data characters.
 * - 1 - Receiver and transmitter use 10-bit data characters.
 */
/*@{*/
#define BP_UART0_C4_M10      (5U)          /*!< Bit position for UART0_C4_M10. */
#define BM_UART0_C4_M10      (0x20U)       /*!< Bit mask for UART0_C4_M10. */
#define BS_UART0_C4_M10      (1U)          /*!< Bit field size in bits for UART0_C4_M10. */

/*! @brief Read current value of the UART0_C4_M10 field. */
#define BR_UART0_C4_M10(x)   (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_M10, BS_UART0_C4_M10))

/*! @brief Format value for bitfield UART0_C4_M10. */
#define BF_UART0_C4_M10(v)   ((uint8_t)((uint8_t)(v) << BP_UART0_C4_M10) & BM_UART0_C4_M10)

/*! @brief Set the M10 field to a new value. */
#define BW_UART0_C4_M10(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_M10), BP_UART0_C4_M10, 1))
/*@}*/

/*!
 * @name Register UART0_C4, field MAEN2[6] (RW)
 *
 * Refer to Match address operation for more information.
 *
 * Values:
 * - 0 - All data received is transferred to the data buffer if MAEN1 is cleared.
 * - 1 - All data received with the most significant bit cleared, is discarded.
 *     All data received with the most significant bit set, is compared with
 *     contents of MA2 register. If no match occurs, the data is discarded. If match
 *     occurs, data is transferred to the data buffer.
 */
/*@{*/
#define BP_UART0_C4_MAEN2    (6U)          /*!< Bit position for UART0_C4_MAEN2. */
#define BM_UART0_C4_MAEN2    (0x40U)       /*!< Bit mask for UART0_C4_MAEN2. */
#define BS_UART0_C4_MAEN2    (1U)          /*!< Bit field size in bits for UART0_C4_MAEN2. */

/*! @brief Read current value of the UART0_C4_MAEN2 field. */
#define BR_UART0_C4_MAEN2(x) (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_MAEN2, BS_UART0_C4_MAEN2))

/*! @brief Format value for bitfield UART0_C4_MAEN2. */
#define BF_UART0_C4_MAEN2(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C4_MAEN2) & BM_UART0_C4_MAEN2)

/*! @brief Set the MAEN2 field to a new value. */
#define BW_UART0_C4_MAEN2(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_MAEN2), BP_UART0_C4_MAEN2, 1))
/*@}*/

/*!
 * @name Register UART0_C4, field MAEN1[7] (RW)
 *
 * Refer to Match address operation for more information.
 *
 * Values:
 * - 0 - All data received is transferred to the data buffer if MAEN2 is cleared.
 * - 1 - All data received with the most significant bit cleared, is discarded.
 *     All data received with the most significant bit set, is compared with
 *     contents of MA1 register. If no match occurs, the data is discarded. If match
 *     occurs, data is transferred to the data buffer.
 */
/*@{*/
#define BP_UART0_C4_MAEN1    (7U)          /*!< Bit position for UART0_C4_MAEN1. */
#define BM_UART0_C4_MAEN1    (0x80U)       /*!< Bit mask for UART0_C4_MAEN1. */
#define BS_UART0_C4_MAEN1    (1U)          /*!< Bit field size in bits for UART0_C4_MAEN1. */

/*! @brief Read current value of the UART0_C4_MAEN1 field. */
#define BR_UART0_C4_MAEN1(x) (BME_UBFX8(HW_UART0_C4_ADDR(x), BP_UART0_C4_MAEN1, BS_UART0_C4_MAEN1))

/*! @brief Format value for bitfield UART0_C4_MAEN1. */
#define BF_UART0_C4_MAEN1(v) ((uint8_t)((uint8_t)(v) << BP_UART0_C4_MAEN1) & BM_UART0_C4_MAEN1)

/*! @brief Set the MAEN1 field to a new value. */
#define BW_UART0_C4_MAEN1(x, v) (BME_BFI8(HW_UART0_C4_ADDR(x), ((uint8_t)(v) << BP_UART0_C4_MAEN1), BP_UART0_C4_MAEN1, 1))
/*@}*/

/*******************************************************************************
 * HW_UART0_C5 - UART Control Register 5
 ******************************************************************************/

/*!
 * @brief HW_UART0_C5 - UART Control Register 5 (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart0_c5
{
    uint8_t U;
    struct _hw_uart0_c5_bitfields
    {
        uint8_t RESYNCDIS : 1;         /*!< [0] Resynchronization Disable */
        uint8_t BOTHEDGE : 1;          /*!< [1] Both Edge Sampling */
        uint8_t RESERVED0 : 3;         /*!< [4:2]  */
        uint8_t RDMAE : 1;             /*!< [5] Receiver Full DMA Enable */
        uint8_t RESERVED1 : 1;         /*!< [6]  */
        uint8_t TDMAE : 1;             /*!< [7] Transmitter DMA Enable */
    } B;
} hw_uart0_c5_t;

/*!
 * @name Constants and macros for entire UART0_C5 register
 */
/*@{*/
#define HW_UART0_C5_ADDR(x)      ((uint32_t)(x) + 0xBU)

#define HW_UART0_C5(x)           (*(__IO hw_uart0_c5_t *) HW_UART0_C5_ADDR(x))
#define HW_UART0_C5_RD(x)        (HW_UART0_C5(x).U)
#define HW_UART0_C5_WR(x, v)     (HW_UART0_C5(x).U = (v))
#define HW_UART0_C5_SET(x, v)    (BME_OR8(HW_UART0_C5_ADDR(x), (uint8_t)(v)))
#define HW_UART0_C5_CLR(x, v)    (BME_AND8(HW_UART0_C5_ADDR(x), (uint8_t)(~(v))))
#define HW_UART0_C5_TOG(x, v)    (BME_XOR8(HW_UART0_C5_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual UART0_C5 bitfields
 */

/*!
 * @name Register UART0_C5, field RESYNCDIS[0] (RW)
 *
 * When set, disables the resynchronization of the received data word when a
 * data one followed by data zero transition is detected. This bit should only be
 * changed when the receiver is disabled.
 *
 * Values:
 * - 0 - Resynchronization during received data word is supported
 * - 1 - Resynchronization during received data word is disabled
 */
/*@{*/
#define BP_UART0_C5_RESYNCDIS (0U)         /*!< Bit position for UART0_C5_RESYNCDIS. */
#define BM_UART0_C5_RESYNCDIS (0x01U)      /*!< Bit mask for UART0_C5_RESYNCDIS. */
#define BS_UART0_C5_RESYNCDIS (1U)         /*!< Bit field size in bits for UART0_C5_RESYNCDIS. */

